In [3]:
import pandas as pd
import numpy as np

In [4]:
jobs = pd.read_csv("./data/updated_jobs.csv")

In [3]:
jobs.head()

,job_title_short,job_title,job_location,job_via,job_schedule_type,job_work_from_home,search_location,job_posted_date,job_no_degree_mention,job_health_insurance,job_country,salary_rate,salary_year_avg,salary_hour_avg,company_name,job_skills,job_type_skills
0,Senior Data Engineer,Senior Clinical Data Engineer / Principal Clin...,"Watertown, CT",via Work Nearby,Full-time,False,"Texas, United States",2023-06-16 13:44:15,False,False,United States,NaN,NaN,NaN,Boehringer Ingelheim,NaN,NaN
1,Data Analyst,Data Analyst,"Guadalajara, Jalisco, Mexico",via BeBee México,Full-time,False,Mexico,2023-01-14 13:18:07,False,False,Mexico,NaN,NaN,NaN,Hewlett Packard Enterprise,"['r', 'python', 'sql', 'nosql', 'power bi', 't...","{'analyst_tools': ['power bi', 'tableau'], 'pr..."
2,Data Engineer,"Data Engineer/Scientist/Analyst, Mid or Senior...","Berlin, Germany",via LinkedIn,Full-time,False,Germany,2023-10-10 13:14:55,False,False,Germany,NaN,NaN,NaN,ALPHA Augmented Services,"['python', 'sql', 'c#', 'azure', 'airflow', 'd...","{'analyst_tools': ['dax'], 'cloud': ['azure'],..."
3,Data Engineer,LEAD ENGINEER - PRINCIPAL ANALYST - PRINCIPAL ...,"San Antonio, TX",via Diversity.com,Full-time,False,"Texas, United States",2023-07-04 13:01:41,True,False,United States,NaN,NaN,NaN,Southwest Research Institute,"['python', 'c++', 'java', 'matlab', 'aws', 'te...","{'cloud': ['aws'], 'libraries': ['tensorflow',..."
4,Data Engineer,Data Engineer- Sr Jobs,"Washington, DC",via Clearance Jobs,Full-time,False,Sudan,2023-08-07 14:29:36,False,False,Sudan,NaN,NaN,NaN,Kristina Daniel,"['bash', 'python', 'oracle', 'aws', 'ansible',...","{'cloud': ['oracle', 'aws'], 'other': ['ansibl..."

In [4]:
jobs.tail()

,job_title_short,job_title,job_location,job_via,job_schedule_type,job_work_from_home,search_location,job_posted_date,job_no_degree_mention,job_health_insurance,job_country,salary_rate,salary_year_avg,salary_hour_avg,company_name,job_skills,job_type_skills
785736,Software Engineer,DevOps Engineer,Singapura,melalui Trabajo.org,Pekerjaan tetap,False,Singapore,2023-03-13 06:16:16,False,False,Singapore,NaN,NaN,NaN,CAREERSTAR INTERNATIONAL PTE. LTD.,"['bash', 'python', 'perl', 'linux', 'unix', 'k...","{'os': ['linux', 'unix'], 'other': ['kubernete..."
785737,Data Analyst,CRM Data Analyst,"Bad Rodach, Jerman",melalui BeBee Deutschland,Pekerjaan tetap,False,Germany,2023-03-12 06:18:18,False,False,Germany,NaN,NaN,NaN,HABA FAMILYGROUP,"['sas', 'sas', 'sql', 'excel']","{'analyst_tools': ['sas', 'excel'], 'programmi..."
785738,Business Analyst,Commercial Analyst - Start Now,Malaysia,melalui Ricebowl,Pekerjaan tetap,False,Malaysia,2023-03-12 06:32:36,False,False,Malaysia,NaN,NaN,NaN,Lendlease Corporation,"['powerpoint', 'excel']","{'analyst_tools': ['powerpoint', 'excel']}"
785739,Data Engineer,"Principal Associate, Data Engineer (Remote-Eli...","Newark, New Jersey, Amerika Serikat",melalui Recruit.net,Pekerjaan tetap,False,Sudan,2023-03-12 06:32:15,False,False,Sudan,NaN,NaN,NaN,Capital One,"['python', 'go', 'nosql', 'sql', 'mongo', 'she...","{'cloud': ['aws', 'snowflake', 'azure', 'redsh..."
785740,Software Engineer,AWS System Analyst,India,melalui Trigyn,Pekerjaan tetap,False,India,2023-03-13 06:16:31,False,False,India,NaN,NaN,NaN,Trigyn,"['aws', 'flow']","{'cloud': ['aws'], 'other': ['flow']}"

In [7]:
jobs.shape

(785741, 17)

In [8]:
jobs.columns

Index(['job_title_short', 'job_title', 'job_location', 'job_via',
       'job_schedule_type', 'job_work_from_home', 'search_location',
       'job_posted_date', 'job_no_degree_mention', 'job_health_insurance',
       'job_country', 'salary_rate', 'salary_year_avg', 'salary_hour_avg',
       'company_name', 'job_skills', 'job_type_skills'],
      dtype='object')

In [9]:
jobs.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 785741 entries, 0 to 785740
Data columns (total 17 columns):
 #   Column                 Non-Null Count   Dtype
---  ------                 --------------   -----
 0   job_title_short        785741 non-null  object
 1   job_title              785740 non-null  object
 2   job_location           784696 non-null  object
 3   job_via                785733 non-null  object
 4   job_schedule_type      773074 non-null  object
 5   job_work_from_home     785741 non-null  bool
 6   search_location        785741 non-null  object
 7   job_posted_date        785741 non-null  object
 8   job_no_degree_mention  785741 non-null  bool
 9   job_health_insurance   785741 non-null  bool
 10  job_country            785692 non-null  object
 11  salary_rate            33067 non-null   object
 12  salary_year_avg        22003 non-null   float64
 13  salary_hour_avg        10662 non-null   float64
 14  company_name           785723 non-null  object
 15  job_skills             668704 non-null  object
 16  job_type_skills        668704 non-null  object
dtypes: bool(3), float64(2), object(12)
memory usage: 86.2+ MB

In [14]:
jobs["job_posted_date"] = pd.to_datetime(jobs["job_posted_date"])

In [15]:
jobs.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 785741 entries, 0 to 785740
Data columns (total 17 columns):
 #   Column                 Non-Null Count   Dtype
---  ------                 --------------   -----
 0   job_title_short        785741 non-null  object
 1   job_title              785740 non-null  object
 2   job_location           784696 non-null  object
 3   job_via                785733 non-null  object
 4   job_schedule_type      773074 non-null  object
 5   job_work_from_home     785741 non-null  bool
 6   search_location        785741 non-null  object
 7   job_posted_date        785741 non-null  datetime64[ns]
 8   job_no_degree_mention  785741 non-null  bool
 9   job_health_insurance   785741 non-null  bool
 10  job_country            785692 non-null  object
 11  salary_rate            33067 non-null   object
 12  salary_year_avg        22003 non-null   float64
 13  salary_hour_avg        10662 non-null   float64
 14  company_name           785723 non-null  object
 15  job_skills             668704 non-null  object
 16  job_type_skills        668704 non-null  object
dtypes: bool(3), datetime64[ns](1), float64(2), object(11)
memory usage: 86.2+ MB

In [16]:
jobs.head()

,job_title_short,job_title,job_location,job_via,job_schedule_type,job_work_from_home,search_location,job_posted_date,job_no_degree_mention,job_health_insurance,job_country,salary_rate,salary_year_avg,salary_hour_avg,company_name,job_skills,job_type_skills
0,Senior Data Engineer,Senior Clinical Data Engineer / Principal Clin...,"Watertown, CT",via Work Nearby,Full-time,False,"Texas, United States",2023-06-16 13:44:15,False,False,United States,NaN,NaN,NaN,Boehringer Ingelheim,NaN,NaN
1,Data Analyst,Data Analyst,"Guadalajara, Jalisco, Mexico",via BeBee México,Full-time,False,Mexico,2023-01-14 13:18:07,False,False,Mexico,NaN,NaN,NaN,Hewlett Packard Enterprise,"['r', 'python', 'sql', 'nosql', 'power bi', 't...","{'analyst_tools': ['power bi', 'tableau'], 'pr..."
2,Data Engineer,"Data Engineer/Scientist/Analyst, Mid or Senior...","Berlin, Germany",via LinkedIn,Full-time,False,Germany,2023-10-10 13:14:55,False,False,Germany,NaN,NaN,NaN,ALPHA Augmented Services,"['python', 'sql', 'c#', 'azure', 'airflow', 'd...","{'analyst_tools': ['dax'], 'cloud': ['azure'],..."
3,Data Engineer,LEAD ENGINEER - PRINCIPAL ANALYST - PRINCIPAL ...,"San Antonio, TX",via Diversity.com,Full-time,False,"Texas, United States",2023-07-04 13:01:41,True,False,United States,NaN,NaN,NaN,Southwest Research Institute,"['python', 'c++', 'java', 'matlab', 'aws', 'te...","{'cloud': ['aws'], 'libraries': ['tensorflow',..."
4,Data Engineer,Data Engineer- Sr Jobs,"Washington, DC",via Clearance Jobs,Full-time,False,Sudan,2023-08-07 14:29:36,False,False,Sudan,NaN,NaN,NaN,Kristina Daniel,"['bash', 'python', 'oracle', 'aws', 'ansible',...","{'cloud': ['oracle', 'aws'], 'other': ['ansibl..."

In [17]:
jobs.sample(40)

,job_title_short,job_title,job_location,job_via,job_schedule_type,job_work_from_home,search_location,job_posted_date,job_no_degree_mention,job_health_insurance,job_country,salary_rate,salary_year_avg,salary_hour_avg,company_name,job_skills,job_type_skills
722087,Data Analyst,(ITIL) Reporting and Analytics Management Spec...,"Santiago, Nuevo Leon, Mexico",via BeBee,Full-time,False,Mexico,2023-09-16 21:13:08,False,False,Mexico,NaN,NaN,NaN,Bombardier Inc.,"['power bi', 'word', 'excel', 'powerpoint']","{'analyst_tools': ['power bi', 'word', 'excel'..."
46999,Senior Data Scientist,Senior Data Scientist,South Africa,via CareerJunction,Full-time,False,South Africa,2023-11-18 06:32:37,False,False,South Africa,NaN,NaN,NaN,Hi-Tech Cape Town,['r'],{'programming': ['r']}
631328,Senior Data Scientist,Senior Data Scientist (AI),"London, UK",via LinkedIn,Full-time,False,United Kingdom,2023-09-30 12:33:16,False,False,United Kingdom,NaN,NaN,NaN,Harnham,"['python', 'sql']","{'programming': ['python', 'sql']}"
663256,Business Analyst,Pastel Clerk,South Africa,via Pnet,Part-time,False,South Africa,2023-07-31 10:58:40,True,False,South Africa,NaN,NaN,NaN,CMS,['word'],{'analyst_tools': ['word']}
482508,Senior Data Analyst,Senior Data Analyst,"Riolo Terme, Province of Ravenna, Italy",via Lavoro Trabajo.org,Full-time,False,Italy,2023-02-02 14:49:09,False,False,Italy,NaN,NaN,NaN,Adecco,"['sql', 'r', 'python', 'javascript', 'mongodb'...","{'analyst_tools': ['power bi', 'tableau', 'qli..."
122910,Data Analyst,Data Analyst. Job in Leeds My Valley Jobs Today,"Leeds, UK",via My Valley Jobs Today,Full-time,False,United Kingdom,2023-02-13 08:32:17,True,False,United Kingdom,NaN,NaN,NaN,QUANTICA,['excel'],{'analyst_tools': ['excel']}
165548,Data Analyst,Data Analyst,"Ploieștiori, Romania",via BestJobs,Full-time,False,Romania,2023-01-10 15:44:28,False,False,Romania,NaN,NaN,NaN,LEDMAX ELECTRONICS,['excel'],{'analyst_tools': ['excel']}
284043,Data Scientist,Data Scientist H/F,"Grenoble, France",via Indeed,Full-time,False,France,2023-07-06 07:26:12,False,False,France,NaN,NaN,NaN,FONCTION:SUPPORT,NaN,NaN
619020,Data Scientist,Data Scientist/SR Data Scientist - Remote,Anywhere,via LinkedIn,Full-time,True,"Illinois, United States",2023-12-07 12:06:27,False,False,United States,NaN,NaN,NaN,Boehringer Ingelheim,"['r', 'python', 'sql', 'sql server', 'oracle',...","{'analyst_tools': ['ssis', 'excel', 'cognos'],..."
772651,Data Scientist,Data Analytics Developer,Australia,via BeBee Australia,Full-time,False,Australia,2023-10-14 01:33:45,True,False,Australia,NaN,NaN,NaN,The Smith Family,"['t-sql', 'azure', 'power bi', 'dax']","{'analyst_tools': ['power bi', 'dax'], 'cloud'..."
752348,Data Analyst,"Data consultant, data analyst, analyst consultant","Neckarsulm, Germany",via BeBee,Full-time,False,Germany,2023-12-17 20:15:02,True,False,Germany,NaN,NaN,NaN,PVS Europe GmbH & Co. OHG - Neckarsulm,['tableau'],{'analyst_tools': ['tableau']}
549804,Data Analyst,Business Systems & Data Analyst,"Cupertino, CA",via ICrunchData,Full-time,False,"California, United States",2023-04-24 19:00:46,False,True,United States,NaN,NaN,NaN,Apple,"['sql', 'tableau']","{'analyst_tools': ['tableau'], 'programming': ..."
129542,Data Scientist,Data Scientist,Dubai - United Arab Emirates,via LinkedIn,Contractor,False,United Arab Emirates,2023-10-18 08:19:12,False,False,United Arab Emirates,NaN,NaN,NaN,TASC Outsourcing,"['python', 'r', 'sql', 'databricks', 'azure', ...","{'analyst_tools': ['power bi', 'tableau'], 'cl..."
665295,Data Engineer,Data Engineer - Relocation to USA,Poland,via LinkedIn,Full-time,False,Poland,2023-06-26 10:47:00,True,False,Poland,NaN,NaN,NaN,Micro Solutions,"['sql', 'tableau']","{'analyst_tools': ['tableau'], 'programming': ..."
619397,Data Scientist,KSU Equifax Data Science Research Lab--Researc...,"Atlanta, GA",via LinkedIn,Part-time,False,Georgia,2023-05-09 13:38:08,False,False,United States,NaN,NaN,NaN,Equifax,"['python', 'r', 'sql', 'spark']","{'libraries': ['spark'], 'programming': ['pyth..."
512622,Data Analyst,Data Analyst Professional. Job in McLean WDTN ...,"McLean, VA",via WDTN Jobs,Contractor,False,"New York, United States",2023-10-17 11:00:18,True,True,United States,NaN,NaN,NaN,Genesis10,"['python', 'sql', 'snowflake', 'hadoop', 'unix']","{'cloud': ['snowflake'], 'libraries': ['hadoop..."
687348,Cloud Engineer,Network Infra Engineer,Malaysia,via BeBee Malaysia,Full-time,False,Malaysia,2023-06-28 10:12:49,False,False,Malaysia,NaN,NaN,NaN,Konica Minolta Business Solutions (M) Sdn. Bhd.,NaN,NaN
391474,Data Engineer,Python Data Engineer,"London, UK",via LinkedIn,Full-time,False,United Kingdom,2023-06-10 18:26:42,False,False,United Kingdom,NaN,NaN,NaN,Career Concept Ltd,"['python', 'nosql', 'sql', 'elasticsearch', 'l...","{'databases': ['elasticsearch'], 'os': ['linux..."
719061,Business Analyst,Pricing Analyst,"Bratislava, Slovakia",via Trabajo.org,Full-time,False,Slovakia,2023-06-02 21:49:30,False,False,Slovakia,NaN,NaN,NaN,Zurich Insurance Company Ltd.,"['r', 'python', 'sql']","{'programming': ['r', 'python', 'sql']}"
33315,Data Engineer,Lead BIG Data Engineer,"Pune, Maharashtra, India",via LinkedIn,Full-time,False,India,2023-05-11 13:20:14,True,False,India,NaN,NaN,NaN,Right Move Staffing Solutions Private Limited,"['java', 'python', 'r', 'nosql', 'aws', 'redsh...","{'cloud': ['aws', 'redshift'], 'libraries': ['..."
5395,Data Analyst,(Junior) Dispatch Manager / Data Analyst,"Hamburg, Germany",via SmartRecruiters Job Search,Full-time,False,Germany,2023-04-06 13:16:14,False,False,Germany,NaN,NaN,NaN,Vattenfall,['python'],{'programming': ['python']}
474789,Business Analyst,HR Analyst (Contract),"Lawrenceville, GA",via ZipRecruiter,"Full-time, Contractor, and Temp work",False,Georgia,2023-11-15 14:41:29,True,False,United States,hour,NaN,40.0,Robert Half,"['oracle', 'excel', 'power bi']","{'analyst_tools': ['excel', 'power bi'], 'clou..."
654930,Data Scientist,"Data Scientist, Product Analytics","New York, NY",via LinkedIn,Full-time,False,"New York, United States",2023-03-19 09:59:58,False,False,United States,NaN,NaN,NaN,Peloton Interactive,"['sql', 'python', 'pandas', 'numpy']","{'libraries': ['pandas', 'numpy'], 'programmin..."
534931,Data Engineer,Data Engineer,Anywhere,via LinkedIn,Full-time,True,Sudan,2023-01-10 20:03:01,False,False,Sudan,NaN,NaN,NaN,RKD Group,"['sql', 'php', 'python', 'bash', 'sql server',...","{'async': ['jira'], 'databases': ['sql server'..."
681960,Data Analyst,"Data Analyst (UX/UI, Dashboarding)","New York, NY",via LinkedIn,Full-time,False,"New York, United States",2023-11-30 10:00:13,False,False,United States,NaN,NaN,NaN,Artefact,"['python', 'r', 'sql', 'redshift', 'azure', 'b...","{'analyst_tools': ['tableau', 'looker', 'power..."
59287,Data Engineer,Data engineer pour le Cœur Financier !,"Brussels, Belgium",via VDAB,Full-time,False,Belgium,2023-06-21 06:51:36,True,False,Belgium,NaN,NaN,NaN,AUSTIN BRIGHT,NaN,NaN
486800,Senior Data Engineer,Data Engineer Senior,"Arlington, VA",via Ladders,Full-time,False,Georgia,2023-07-24 11:34:35,False,False,United States,year,100000.0,NaN,BAE Systems,NaN,NaN
153140,Data Scientist,Data Modeler,"Hyderabad, Telangana, India",via LinkedIn,Full-time,False,India,2023-09-15 08:12:19,True,False,India,NaN,NaN,NaN,Tech Mahindra,['sql'],{'programming': ['sql']}
480429,Data Engineer,Data Engineer,"Ashington, Pulborough, UK",via Top Norfolk Careers,Full-time,False,United Kingdom,2023-10-01 14:10:12,True,False,United Kingdom,NaN,NaN,NaN,Nigel Frank International,"['sql', 'azure', 'power bi', 'excel']","{'analyst_tools': ['power bi', 'excel'], 'clou..."
216453,Business Analyst,HR Analyst - IT,"New York, NY",via ZipRecruiter,Contractor,False,"New York, United States",2023-11-21 21:59:51,False,False,United States,NaN,NaN,NaN,Qodoro Global LLC,NaN,NaN
376049,Data Engineer,Data Engineer Jobs,"Washington, DC",via Clearance Jobs,Full-time,False,"Florida, United States",2023-02-03 18:32:32,False,False,United States,NaN,NaN,NaN,Buchanan and Edwards,"['python', 'sql', 'spark', 'git', 'jira', 'con...","{'async': ['jira', 'confluence'], 'libraries':..."
406619,Data Engineer,Data Engineer,United States,via BeBee,Full-time,False,Sudan,2023-08-31 17:25:07,True,True,Sudan,NaN,NaN,NaN,Fortune,"['sql', 'python', 'nosql', 'shell', 'bash', 'p...","{'async': ['jira'], 'cloud': ['aws', 'gcp'], '..."
30199,Data Analyst,Data analyst Confirmé F/H,"Lyon, France",via Jobijoba,Full-time,False,France,2023-08-10 13:40:04,True,False,France,NaN,NaN,NaN,NEXTON CENTER,"['sql', 'python', 'sql server', 'ssis', 'dax',...","{'analyst_tools': ['ssis', 'dax'], 'async': ['..."
561015,Data Analyst,Data Analyst,Dubai - United Arab Emirates,via BeBee,Full-time,False,United Arab Emirates,2023-10-19 04:19:01,False,False,United Arab Emirates,NaN,NaN,NaN,Ultimate HR Solutions,NaN,NaN
692135,Business Analyst,Power BI Analyst,Anywhere,via LinkedIn Azerbaijan,Full-time,True,Azerbaijan,2023-02-07 10:43:20,True,False,Azerbaijan,NaN,NaN,NaN,Valtech,"['sql', 'r', 'python', 'azure', 'power bi']","{'analyst_tools': ['power bi'], 'cloud': ['azu..."
202129,Data Engineer,Data Engineer,"Greenville, SC",via LinkedIn,Full-time,False,"Texas, United States",2023-03-17 22:07:04,False,False,United States,NaN,NaN,NaN,World Finance,"['sql', 'python', 'sql server', 'snowflake', '...","{'analyst_tools': ['ssis'], 'cloud': ['snowfla..."
416763,Data Analyst,Data Analyst - Now Hiring,"Estero, FL",via Snagajob,Full-time,False,"Florida, United States",2023-07-09 16:01:26,False,False,United States,NaN,NaN,NaN,Hertz,"['sql', 'r', 'python', 'ruby', 'ruby', 'php', ...","{'analyst_tools': ['tableau'], 'cloud': ['orac..."
717835,Data Engineer,Data Engineer,"Bristol, UK",via My ArkLaMiss Jobs,Full-time,False,United Kingdom,2023-01-25 02:17:25,True,False,United Kingdom,NaN,NaN,NaN,Lloyds Banking Group,"['sql', 'c#', 'python', 'java', 'sql server', ...","{'async': ['confluence'], 'cloud': ['gcp', 'az..."
395881,Data Scientist,Statistician / Data Scientist with IVD Experience,"Norwood, MA",via BeBee,Full-time,False,"New York, United States",2023-12-05 18:02:43,False,True,United States,NaN,NaN,NaN,Siemens,"['sas', 'sas', 'sql', 'r', 'sql server']","{'analyst_tools': ['sas'], 'databases': ['sql ..."
293506,Data Scientist,ENT-Data Scientist-Anlst III,"Winston-Salem, NC",via Indeed,Full-time,False,Georgia,2023-07-14 17:54:33,False,True,United States,NaN,NaN,NaN,National General Insurance,"['sas', 'sas', 'sql', 'r', 'python']","{'analyst_tools': ['sas'], 'programming': ['sa..."

In [18]:
jobs.isnull().sum()

job_title_short               0
job_title                     1
job_location               1045
job_via                       8
job_schedule_type         12667
job_work_from_home            0
search_location               0
job_posted_date               0
job_no_degree_mention         0
job_health_insurance          0
job_country                  49
salary_rate              752674
salary_year_avg          763738
salary_hour_avg          775079
company_name                 18
job_skills               117037
job_type_skills          117037
dtype: int64

In [20]:
jobs.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 785741 entries, 0 to 785740
Data columns (total 17 columns):
 #   Column                 Non-Null Count   Dtype
---  ------                 --------------   -----
 0   job_title_short        785741 non-null  object
 1   job_title              785740 non-null  object
 2   job_location           784696 non-null  object
 3   job_via                785733 non-null  object
 4   job_schedule_type      773074 non-null  object
 5   job_work_from_home     785741 non-null  bool
 6   search_location        785741 non-null  object
 7   job_posted_date        785741 non-null  datetime64[ns]
 8   job_no_degree_mention  785741 non-null  bool
 9   job_health_insurance   785741 non-null  bool
 10  job_country            785692 non-null  object
 11  salary_rate            33067 non-null   object
 12  salary_year_avg        22003 non-null   float64
 13  salary_hour_avg        10662 non-null   float64
 14  company_name           785723 non-null  object
 15  job_skills             668704 non-null  object
 16  job_type_skills        668704 non-null  object
dtypes: bool(3), datetime64[ns](1), float64(2), object(11)
memory usage: 86.2+ MB

In [21]:
jobs = jobs.dropna(subset=["salary_hour_avg"])

In [22]:
jobs.info()

<class 'pandas.core.frame.DataFrame'>
Index: 10662 entries, 43 to 785492
Data columns (total 17 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   job_title_short        10662 non-null  object
 1   job_title              10662 non-null  object
 2   job_location           10586 non-null  object
 3   job_via                10654 non-null  object
 4   job_schedule_type      10536 non-null  object
 5   job_work_from_home     10662 non-null  bool
 6   search_location        10662 non-null  object
 7   job_posted_date        10662 non-null  datetime64[ns]
 8   job_no_degree_mention  10662 non-null  bool
 9   job_health_insurance   10662 non-null  bool
 10  job_country            10662 non-null  object
 11  salary_rate            10662 non-null  object
 12  salary_year_avg        0 non-null      float64
 13  salary_hour_avg        10662 non-null  float64
 14  company_name           10662 non-null  object
 15  job_skills             9290 non-null   object
 16  job_type_skills        9290 non-null   object
dtypes: bool(3), datetime64[ns](1), float64(2), object(11)
memory usage: 1.3+ MB

In [23]:
jobs.sample(50)

,job_title_short,job_title,job_location,job_via,job_schedule_type,job_work_from_home,search_location,job_posted_date,job_no_degree_mention,job_health_insurance,job_country,salary_rate,salary_year_avg,salary_hour_avg,company_name,job_skills,job_type_skills
421923,Data Engineer,Data Engineer,Anywhere,via JobScore,Full-time,True,Paraguay,2023-06-12 17:30:52,True,False,Paraguay,hour,NaN,80.000000,Braintrust,"['python', 'sql', 'java', 'c#', 'sql server', ...","{'cloud': ['oracle', 'snowflake'], 'databases'..."
443496,Data Analyst,Scientific Data Analyst/ Application Specialist,"New Brunswick, NJ",via WJTV Jobs,Full-time,False,"New York, United States",2023-01-29 16:00:14,False,True,United States,hour,NaN,60.000000,Alpha Consulting,"['excel', 'word', 'powerpoint', 'outlook', 'sh...","{'analyst_tools': ['excel', 'word', 'powerpoin..."
613462,Data Scientist,Data Science Internship,"Omaha, NE",via Indeed,Internship,False,"Illinois, United States",2023-03-26 12:05:22,False,False,United States,hour,NaN,18.000000,CATCH Intelligence,"['r', 'python']","{'programming': ['r', 'python']}"
175581,Business Analyst,Business Intelligence Analyst,"Madison, WI",via Dice.com,Contractor,False,"Illinois, United States",2023-09-12 15:01:50,True,False,United States,hour,NaN,45.000000,Brooksource,"['sas', 'sas', 'sql']","{'analyst_tools': ['sas'], 'programming': ['sa..."
11631,Senior Data Scientist,Senior Data Scientist,"Durham, NC",via LinkedIn,Contractor,False,"New York, United States",2023-10-04 13:03:33,False,True,United States,hour,NaN,83.500000,Magnit,"['sql', 'python', 'r', 'scala', 'spark', 'powe...","{'analyst_tools': ['power bi', 'tableau'], 'li..."
381248,Data Analyst,Data Analyst/ Data Librarian - Now Hiring,"New York, NY",via Snagajob,Full-time,False,"New York, United States",2023-08-02 18:00:16,False,True,United States,hour,NaN,27.980000,Vibrant Emotional Health,"['r', 'sas', 'sas', 'python', 'sql', 'spss', '...","{'analyst_tools': ['sas', 'spss', 'tableau', '..."
621518,Data Analyst,Associate Data Analyst (with Smart Sheet),Anywhere,via Mindlance - Talentify,Contractor,True,"Florida, United States",2023-08-30 12:03:13,False,False,United States,hour,NaN,32.139999,Mindlance,"['sheets', 'excel']","{'analyst_tools': ['sheets', 'excel']}"
219610,Business Analyst,Senior Business Analyst,"St. Petersburg, FL",via ZipRecruiter,Full-time,False,"Florida, United States",2023-05-26 22:02:30,False,False,United States,hour,NaN,63.785000,Intelliswift Software Inc,NaN,NaN
39507,Data Engineer,"Associate, Data Engineer - Now Hiring","Cincinnati, OH",via Snagajob,Full-time,False,"New York, United States",2023-09-02 06:07:27,False,True,United States,hour,NaN,45.634998,KPMG,"['python', 'sql', 'go', 'jira']","{'async': ['jira'], 'programming': ['python', ..."
613245,Data Engineer,Data Engineer / Data Analyst - Full-time,"San Jose, CA",via Snagajob,Full-time,False,"Texas, United States",2023-08-24 12:26:42,False,True,United States,hour,NaN,46.000000,Kelly Services,"['go', 'azure', 'power bi', 'word']","{'analyst_tools': ['power bi', 'word'], 'cloud..."
200545,Data Analyst,Data Analyst (Accepting W2 candidates only),"New York, NY",via LinkedIn,Contractor,False,"New York, United States",2023-03-10 15:00:01,False,False,United States,hour,NaN,47.500000,New Millenium Consulting,"['sql', 'python', 'postgresql', 'aws', 'redshi...","{'async': ['jira', 'confluence'], 'cloud': ['a..."
138604,Data Scientist,Data Scientist Intern (Bachelors),Anywhere,via Hitmarker,Full-time and Internship,True,"California, United States",2023-09-29 08:03:49,False,True,United States,hour,NaN,30.500000,Electronic Arts,['sql'],{'programming': ['sql']}
299924,Senior Data Analyst,Senior Business Data Analyst,"New Bedford, MA",via Snagajob,Full-time and Part-time,False,"New York, United States",2023-09-29 17:00:42,False,True,United States,hour,NaN,27.290001,Point32Health,"['oracle', 'microstrategy']","{'analyst_tools': ['microstrategy'], 'cloud': ..."
354024,Data Scientist,Data Scientist,Anywhere,via Indeed,Full-time,True,"California, United States",2023-06-23 23:21:03,False,False,United States,hour,NaN,67.500000,FocusKPI Inc.,"['python', 'sql', 'gcp', 'aws', 'azure', 'tabl...","{'analyst_tools': ['tableau', 'looker'], 'clou..."
458938,Data Scientist,Data Scientist W2 Only,Anywhere,via LinkedIn,Contractor,True,Sudan,2023-05-11 14:51:42,False,False,Sudan,hour,NaN,62.500000,Falcon IT & Staffing Solutions,"['sql', 'r', 'python', 'scala']","{'programming': ['sql', 'r', 'python', 'scala']}"
674688,Machine Learning Engineer,Machine Learning Developer,Anywhere,via Get.It,Full-time,True,Thailand,2023-09-09 10:17:38,False,False,Thailand,hour,NaN,19.000000,Scopic,"['python', 'r', 'tensorflow', 'flow', 'wire']","{'libraries': ['tensorflow'], 'other': ['flow'..."
738872,Senior Data Analyst,Senior Fraud Data Analyst (708295) // US or GC...,"Washington, DC",via LinkedIn,Full-time,False,"New York, United States",2023-04-18 21:00:24,False,False,United States,hour,NaN,107.500000,Dantech Corporation Inc.,"['sql', 'sas', 'sas', 'snowflake', 'tableau', ...","{'analyst_tools': ['sas', 'tableau', 'ssrs', '..."
472322,Business Analyst,Business Intelligence Analyst,"Davie, FL",via LinkedIn,Contractor,False,"Florida, United States",2023-02-28 14:03:53,True,False,United States,hour,NaN,60.000000,"Synergy Business Consulting, Inc.","['sql', 'sql server', 'databricks', 'aws', 'ta...","{'analyst_tools': ['tableau'], 'cloud': ['data..."
760963,Data Analyst,Data Analyst,"Washington, DC",via Dice,Contractor,False,"New York, United States",2023-07-07 20:00:36,False,True,United States,hour,NaN,25.000000,Kforce Technology Staffing,"['sql', 'python', 'tableau']","{'analyst_tools': ['tableau'], 'programming': ..."
306001,Senior Data Engineer,Senior Data Engineer,Anywhere,via LinkedIn,Contractor,True,"California, United States",2023-05-09 17:19:04,False,False,United States,hour,NaN,70.000000,Apex Systems,"['sql', 'snowflake', 'azure', 'terraform', 'git']","{'cloud': ['snowflake', 'azure'], 'other': ['t..."
56196,Senior Data Scientist,Senior Data Scientist - Clearance Required - N...,"Tysons, VA",via Snagajob,Full-time and Part-time,False,"New York, United States",2023-09-13 06:01:53,False,False,United States,hour,NaN,47.620003,"LMI Consulting, LLC","['python', 'java', 'r', 'matlab', 'scikit-learn']","{'libraries': ['scikit-learn'], 'programming':..."
550231,Data Analyst,Senior Business / Data Analyst,"Charlotte, NC",via Dice,Contractor,False,Georgia,2023-01-20 20:39:02,True,True,United States,hour,NaN,52.500000,Kforce Technology Staffing,"['sql', 'mongo', 'hadoop']","{'libraries': ['hadoop'], 'programming': ['sql..."
35146,Data Scientist,Res Assoc Data Scientist - Pharoah Lab,"West Hollywood, CA",via Indeed,Full-time,False,"California, United States",2023-04-12 13:20:23,False,False,United States,hour,NaN,50.839996,CEDARS-SINAI,"['r', 'python', 'perl', 'sql', 'github']","{'other': ['github'], 'programming': ['r', 'py..."
218649,Data Scientist,Data Governance,"Jersey City, NJ",via LinkedIn,Contractor and Temp work,False,"New York, United States",2023-10-10 22:00:06,True,False,United States,hour,NaN,67.500000,REQ SOLUTIONS,"['sql', 't-sql', 'crystal', 'sql server', 'pos...","{'analyst_tools': ['visio', 'powerpoint', 'exc..."
702023,Software Engineer,"Core Java Developer, Data Analytics Technology...","Tampa, FL",via Snagajob,Full-time and Part-time,False,"Florida, United States",2023-09-18 03:02:06,False,False,United States,hour,NaN,41.010002,Citi,NaN,NaN
375730,Data Analyst,Data Analyst (Intern) United States,"San Jose, CA",via Snagajob,Full-time,False,"California, United States",2023-08-03 18:00:53,False,False,United States,hour,NaN,24.969999,"Cisco Systems, Inc.",NaN,NaN
170587,Data Analyst,Data Analyst/Modeler - W2 Only,"Merrimack, NH",via Dice.com,Contractor,False,"New York, United States",2023-11-07 15:00:07,False,True,United States,hour,NaN,55.000000,SPECTRAFORCE TECHNOLOGIES Inc.,"['sql', 'nosql', 'mongodb', 'mongodb', 'snowfl...","{'cloud': ['snowflake', 'oracle'], 'databases'..."
454467,Data Analyst,Supplier Resources Data Analyst,"Irving, TX",via ZipRecruiter,Full-time,False,"Texas, United States",2023-06-30 14:01:45,True,False,United States,hour,NaN,20.000000,CornerStone Staffing,['excel'],{'analyst_tools': ['excel']}
747772,Data Analyst,Data Analyst,"Reading, MA",via Dice,Contractor,False,"New York, United States",2023-02-20 20:00:15,False,False,United States,hour,NaN,42.500000,Apidel Technologies,NaN,NaN
377206,Data Analyst,Lead Research & Data Analyst - Full-time / Par...,"Milwaukee, WI",via Snagajob,Full-time,False,"Illinois, United States",2023-08-22 18:02:42,False,True,United States,hour,NaN,18.070000,Northwestern Mutual,"['sql', 'powerpoint']","{'analyst_tools': ['powerpoint'], 'programming..."
351506,Data Scientist,Lead Data Scientist,Anywhere,via The Elite Job,Full-time and Part-time,True,Singapore,2023-12-28 23:31:27,False,False,Singapore,hour,NaN,25.000000,HR Admin,"['python', 'r', 'tensorflow', 'pytorch']","{'libraries': ['tensorflow', 'pytorch'], 'prog..."
538915,Data Engineer,Data Engineer,Anywhere,via LinkedIn,Contractor,True,"California, United States",2023-08-07 19:23:42,False,False,United States,hour,NaN,72.500000,Prime Team Partners,"['python', 'mysql', 'postgresql', 'dynamodb', ...","{'cloud': ['snowflake', 'redshift'], 'database..."
537162,Data Analyst,Business Data Analyst (W2),"Stamford, CT",via Dice,Contractor,False,"New York, United States",2023-06-22 19:00:08,True,False,United States,hour,NaN,51.000000,Torque Technologies LLC,['sql'],{'programming': ['sql']}
740118,Data Scientist,"Data Scientist, Specialist - Now Hiring","Malvern, PA",via Snagajob,Full-time and Part-time,False,"New York, United States",2023-11-19 21:01:35,False,False,United States,hour,NaN,41.505001,The Vanguard Group,"['python', 'go', 'pyspark', 'hugging face', 'e...","{'analyst_tools': ['excel'], 'libraries': ['py..."
307440,Data Analyst,Data Analyst,"Atlanta, GA",via Indeed,Contractor,False,Georgia,2023-01-13 18:19:55,False,False,United States,hour,NaN,24.500000,Expedite Solutions,"['sql', 'outlook']","{'analyst_tools': ['outlook'], 'programming': ..."
42338,Data Scientist,Data Scientist (Intern) United States,"San Jose, CA",via Snagajob,Full-time,False,"California, United States",2023-08-08 06:03:36,False,False,United States,hour,NaN,78.544998,"Cisco Systems, Inc.","['sql', 'r', 'python', 'javascript', 'sas', 's...","{'analyst_tools': ['sas', 'excel', 'spss'], 'c..."
595893,Data Analyst,Japanese speaking Online Data Analyst in Japan,Anywhere,via Get.It,Contractor,True,Japan,2023-01-16 09:58:20,True,False,Japan,hour,NaN,10.000000,Telus International AI,['go'],{'programming': ['go']}
164727,Data Engineer,Data Engineering Consultant (Hybrid),"Bay City, WI",via Snagajob,Full-time and Part-time,False,"New York, United States",2023-09-06 15:02:59,False,True,United States,hour,NaN,50.965000,Securian Financial Group,"['sql', 'aws', 'flow']","{'cloud': ['aws'], 'other': ['flow'], 'program..."
180516,Data Engineer,Data Engineer,"Portland, OR",via Dice,Contractor,False,"Illinois, United States",2023-03-08 15:09:16,True,False,United States,hour,NaN,55.000000,Yorkshire Global Solutions Inc.,"['python', 'sql', 'nosql', 'java', 'scala', 's...","{'cloud': ['aws'], 'libraries': ['pyspark', 'h..."
697224,Data Scientist,PhD Data Scientist,Anywhere,via Upwork,Contractor,True,"Texas, United States",2023-09-06 03:03:11,False,False,United States,hour,NaN,35.000000,Upwork,NaN,NaN
289452,Data Engineer,Big Data Engineer,"Mooresville, NC",via Indeed,Full-time,False,"California, United States",2023-06-15 17:22:56,True,False,United States,hour,NaN,45.000000,arche group,"['shell', 'sql', 'snowflake', 'spark', 'kafka']","{'cloud': ['snowflake'], 'libraries': ['spark'..."
742069,Data Engineer,Data Engineer,"Charlotte, NC",via LinkedIn,Contractor and Temp work,False,"Texas, United States",2023-10-17 20:09:44,False,False,United States,hour,NaN,87.500000,Strategic Staffing Solutions,"['sql', 'aws']","{'cloud': ['aws'], 'programming': ['sql']}"
244147,Data Scientist,Data Scientist: Zebra - Contract to Hire,Anywhere,via Upwork,Contractor and Temp work,True,"Illinois, United States",2023-09-15 07:04:18,False,False,United States,hour,NaN,95.000000,Upwork,NaN,NaN
738225,Senior Data Analyst,Senior Data Analyst,"New York, NY",via Indeed,Full-time,False,"New York, United States",2023-09-05 21:00:02,True,False,United States,hour,NaN,82.500000,EHR Evolution,"['sql', 'r', 'sas', 'sas', 'matlab', 'python',...","{'analyst_tools': ['sas', 'excel', 'spss'], 'p..."
612727,Data Analyst,Data Analyst - Database Developer,"Smithfield, RI",via ZipRecruiter,Full-time,False,"New York, United States",2023-06-05 12:00:31,False,True,United States,hour,NaN,33.000000,A-Line Staffing Solutions,"['sql', 'vba', 'c#', 'sql server', 'excel']","{'analyst_tools': ['excel'], 'databases': ['sq..."
545463,Data Engineer,Technical Lead; Data Engineer,Anywhere,via Robert Half,Contractor,True,Sudan,2023-04-19 20:13:29,False,False,Sudan,hour,NaN,71.000000,Robert Half,"['python', 'java', 'sql', 'perl', 'javascript'...","{'cloud': ['aurora', 'gcp'], 'other': ['ansibl..."
45581,Data Analyst,Supply Chain Data Analytics Manager,"Columbia, MD",via Snagajob,Full-time,False,"New York, United States",2023-08-14 06:01:02,False,True,United States,hour,NaN,23.695000,W. R. Grace & Co,NaN,NaN
744452,Data Scientist,(Agile1) Data Scientist,Anywhere,via LinkedIn,Contractor,True,"Texas, United States",2023-01-20 20:22:27,False,False,United States,hour,NaN,93.500000,TekWissen ®,"['oracle', 'ssrs', 'power bi', 'word', 'excel'...","{'analyst_tools': ['ssrs', 'power bi', 'word',..."
375405,Data Engineer,Data Engineering Consultant (Hybrid) - Full-ti...,"St Paul, MN",via Snagajob,Full-time,False,"Texas, United States",2023-08-09 18:06:44,False,True,United States,hour,NaN,50.965000,Securian Financial Group,"['sql', 'aws', 'flow']","{'cloud': ['aws'], 'other': ['flow'], 'program..."
164162,Data Engineer,Snowflake/DBT Data Engineer,Anywhere,via LinkedIn,Part-time,True,Georgia,2023-06-15 15:45:30,True,True,United States,hour,NaN,37.500000,Archon Resources,"['sql', 'sql server', 'snowflake', 'airflow', ...","{'cloud': ['snowflake'], 'databases': ['sql se..."

In [25]:
null_salary = jobs[jobs.isnull().any(axis=1)].copy()

In [26]:
null_salary

,job_title_short,job_title,job_location,job_via,job_schedule_type,job_work_from_home,search_location,job_posted_date,job_no_degree_mention,job_health_insurance,job_country,salary_rate,salary_year_avg,salary_hour_avg,company_name,job_skills,job_type_skills
43,Senior Data Engineer,Sr SQL Database Engineer with Data Warehouse /...,NaN,via LinkedIn,Contractor,False,"Texas, United States",2023-09-13 13:06:55,True,False,United States,hour,NaN,97.500000,Phaxis,"['sql', 'sql server']","{'databases': ['sql server'], 'programming': [..."
51,Senior Data Engineer,Senior Data Engineer,Anywhere,via LinkedIn,Contractor,True,"Illinois, United States",2023-06-21 13:09:39,False,False,United States,hour,NaN,72.500000,Aditi Consulting,"['python', 'java', 'aws', 'databricks', 'spark']","{'cloud': ['aws', 'databricks'], 'libraries': ..."
253,Data Engineer,Data Engineer,Anywhere,via Upwork,Contractor and Temp work,True,Georgia,2023-11-26 13:54:45,True,False,United States,hour,NaN,88.000000,Upwork,"['sql', 'python', 'java', 'mysql', 'postgresql...","{'cloud': ['aws', 'gcp'], 'databases': ['mysql..."
294,Data Analyst,Business/Data Analyst,"Hartford, CT",via Dice,Contractor,False,"New York, United States",2023-07-03 13:00:08,False,False,United States,hour,NaN,52.500000,"Vector Consulting, Inc",NaN,NaN
340,Data Analyst,23-00059 BI Data Analysts + Media experience -...,California,via LinkedIn,Contractor,False,"California, United States",2023-02-28 13:01:46,True,False,United States,hour,NaN,67.500000,"iSpace, Inc.","['go', 'sql', 'aws', 'snowflake', 'tableau', '...","{'analyst_tools': ['tableau', 'looker', 'word'..."
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
784068,Data Engineer,"Manager, Data Engineering","New York, NY",via Snagajob,Full-time,False,Sudan,2023-08-12 06:37:26,False,True,Sudan,hour,NaN,54.420002,Vibrant Emotional Health,"['sql', 'python', 'r', 'snowflake', 'aws']","{'cloud': ['snowflake', 'aws'], 'programming':..."
784267,Senior Data Engineer,Senior Lead Data Engineer - Now Hiring,"Fredericksburg, VA",via Snagajob,Full-time and Part-time,False,"California, United States",2023-11-13 06:03:59,False,True,United States,hour,NaN,61.159996,Capital One,"['java', 'scala', 'python', 'nosql', 'sql', 'm...","{'cloud': ['redshift', 'snowflake', 'aws', 'az..."
785111,Senior Data Engineer,"Health and Civil Data Engineer, Senior - Now H...","Bethesda, MD",via Snagajob,Full-time and Part-time,False,Georgia,2023-10-08 06:50:59,False,True,United States,hour,NaN,61.159996,Booz Allen Hamilton,"['python', 'sql', 'scala', 'java', 'shell', 'n...","{'cloud': ['aws', 'azure', 'databricks', 'reds..."
785476,Data Scientist,"Data Scientist, Lead","Washington, DC",via Snagajob,Full-time and Part-time,False,Georgia,2023-11-01 06:58:10,False,True,United States,hour,NaN,47.620003,Booz Allen Hamilton,"['databricks', 'azure', 'aws']","{'cloud': ['databricks', 'azure', 'aws']}"
785492,Data Scientist,Data Scientist,"Arlington, VA",via Snagajob,Full-time and Part-time,False,Georgia,2023-11-01 06:58:02,False,True,United States,hour,NaN,47.620003,Booz Allen Hamilton,"['python', 'r', 'pyspark']","{'libraries': ['pyspark'], 'programming': ['py..."

In [27]:
null_salary.info()

<class 'pandas.core.frame.DataFrame'>
Index: 10662 entries, 43 to 785492
Data columns (total 17 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   job_title_short        10662 non-null  object
 1   job_title              10662 non-null  object
 2   job_location           10586 non-null  object
 3   job_via                10654 non-null  object
 4   job_schedule_type      10536 non-null  object
 5   job_work_from_home     10662 non-null  bool
 6   search_location        10662 non-null  object
 7   job_posted_date        10662 non-null  datetime64[ns]
 8   job_no_degree_mention  10662 non-null  bool
 9   job_health_insurance   10662 non-null  bool
 10  job_country            10662 non-null  object
 11  salary_rate            10662 non-null  object
 12  salary_year_avg        0 non-null      float64
 13  salary_hour_avg        10662 non-null  float64
 14  company_name           10662 non-null  object
 15  job_skills             9290 non-null   object
 16  job_type_skills        9290 non-null   object
dtypes: bool(3), datetime64[ns](1), float64(2), object(11)
memory usage: 1.3+ MB

In [28]:
null_salary.isnull().sum()

job_title_short              0
job_title                    0
job_location                76
job_via                      8
job_schedule_type          126
job_work_from_home           0
search_location              0
job_posted_date              0
job_no_degree_mention        0
job_health_insurance         0
job_country                  0
salary_rate                  0
salary_year_avg          10662
salary_hour_avg              0
company_name                 0
job_skills                1372
job_type_skills           1372
dtype: int64

In [29]:
null_salary["salary_year_avg"] = null_salary["salary_year_avg"].fillna(jobs["salary_year_avg"].mean())

In [30]:
null_salary.head()

,job_title_short,job_title,job_location,job_via,job_schedule_type,job_work_from_home,search_location,job_posted_date,job_no_degree_mention,job_health_insurance,job_country,salary_rate,salary_year_avg,salary_hour_avg,company_name,job_skills,job_type_skills
43,Senior Data Engineer,Sr SQL Database Engineer with Data Warehouse /...,NaN,via LinkedIn,Contractor,False,"Texas, United States",2023-09-13 13:06:55,True,False,United States,hour,NaN,97.5,Phaxis,"['sql', 'sql server']","{'databases': ['sql server'], 'programming': [..."
51,Senior Data Engineer,Senior Data Engineer,Anywhere,via LinkedIn,Contractor,True,"Illinois, United States",2023-06-21 13:09:39,False,False,United States,hour,NaN,72.5,Aditi Consulting,"['python', 'java', 'aws', 'databricks', 'spark']","{'cloud': ['aws', 'databricks'], 'libraries': ..."
253,Data Engineer,Data Engineer,Anywhere,via Upwork,Contractor and Temp work,True,Georgia,2023-11-26 13:54:45,True,False,United States,hour,NaN,88.0,Upwork,"['sql', 'python', 'java', 'mysql', 'postgresql...","{'cloud': ['aws', 'gcp'], 'databases': ['mysql..."
294,Data Analyst,Business/Data Analyst,"Hartford, CT",via Dice,Contractor,False,"New York, United States",2023-07-03 13:00:08,False,False,United States,hour,NaN,52.5,"Vector Consulting, Inc",NaN,NaN
340,Data Analyst,23-00059 BI Data Analysts + Media experience -...,California,via LinkedIn,Contractor,False,"California, United States",2023-02-28 13:01:46,True,False,United States,hour,NaN,67.5,"iSpace, Inc.","['go', 'sql', 'aws', 'snowflake', 'tableau', '...","{'analyst_tools': ['tableau', 'looker', 'word'..."

In [31]:
jobs.info()

<class 'pandas.core.frame.DataFrame'>
Index: 10662 entries, 43 to 785492
Data columns (total 17 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   job_title_short        10662 non-null  object
 1   job_title              10662 non-null  object
 2   job_location           10586 non-null  object
 3   job_via                10654 non-null  object
 4   job_schedule_type      10536 non-null  object
 5   job_work_from_home     10662 non-null  bool
 6   search_location        10662 non-null  object
 7   job_posted_date        10662 non-null  datetime64[ns]
 8   job_no_degree_mention  10662 non-null  bool
 9   job_health_insurance   10662 non-null  bool
 10  job_country            10662 non-null  object
 11  salary_rate            10662 non-null  object
 12  salary_year_avg        0 non-null      float64
 13  salary_hour_avg        10662 non-null  float64
 14  company_name           10662 non-null  object
 15  job_skills             9290 non-null   object
 16  job_type_skills        9290 non-null   object
dtypes: bool(3), datetime64[ns](1), float64(2), object(11)
memory usage: 1.3+ MB

In [33]:
jobs.sample(20)

,job_title_short,job_title,job_location,job_via,job_schedule_type,job_work_from_home,search_location,job_posted_date,job_no_degree_mention,job_health_insurance,job_country,salary_rate,salary_year_avg,salary_hour_avg,company_name,job_skills,job_type_skills
159839,Data Analyst,Data Analyst,"Naples, FL",via Trabajo.org,Full-time,False,"Florida, United States",2023-10-30 08:01:03,False,False,United States,NaN,NaN,NaN,Bartos Group @ Premiere Plus Realty,"['java', 'python', 'sql', 'aws', 'azure']","{'cloud': ['aws', 'azure'], 'programming': ['j..."
522421,Business Analyst,Sr. Financial Analyst,"Boca Raton, FL",via ZipRecruiter,Full-time,False,"Florida, United States",2023-09-25 11:02:28,True,False,United States,NaN,NaN,NaN,Home - TWS,['excel'],{'analyst_tools': ['excel']}
29682,Senior Data Scientist,Senior Data Scientist - Algorithm design & sys...,"New Delhi, Delhi, India",via Indeed,Full-time,False,India,2023-12-11 13:45:20,False,False,India,NaN,NaN,NaN,SmartHelio,NaN,NaN
164132,Data Engineer,Data Engineer,"Hyderabad, Telangana, India",via LinkedIn,Full-time,False,India,2023-08-16 15:50:24,True,False,India,NaN,NaN,NaN,AMISEQ,"['sql', 'azure', 'aws', 'redshift', 'hadoop', ...","{'analyst_tools': ['power bi'], 'cloud': ['azu..."
454712,Data Engineer,"Data Engineer, Software Development (Data Mana...","Taguig, Metro Manila, Philippines",via Ingram Micro - Talentify,Full-time,False,Philippines,2023-06-14 14:14:04,False,False,Philippines,NaN,NaN,NaN,Ingram Micro,"['python', 'aws', 'redshift', 'sap']","{'analyst_tools': ['sap'], 'cloud': ['aws', 'r..."
473680,Data Analyst,Product Data Analyst,"Madrid, Spain",via BeBee,Full-time,False,Spain,2023-01-06 14:41:06,False,False,Spain,NaN,NaN,NaN,Signify,"['sql', 'python']","{'programming': ['sql', 'python']}"
166093,Data Engineer,Data Engineer - Financial Services,"Huila, Colombia",via Indeed,Full-time,False,Colombia,2023-04-21 15:51:14,False,False,Colombia,NaN,NaN,NaN,LAAgencia,"['python', 'mongodb', 'mongodb', 'scala', 'go'...","{'cloud': ['redshift', 'snowflake', 'aws'], 'd..."
412081,Data Scientist,Data Scientist Insurance (all genders),"Dortmund, Germany",via XING,Full-time,False,Germany,2023-07-03 16:09:21,False,False,Germany,NaN,NaN,NaN,adesso SE,"['python', 'terraform']","{'other': ['terraform'], 'programming': ['pyth..."
556104,Senior Data Analyst,Intelligence Analyst,Riyadh Saudi Arabia,via BeBee,Full-time,False,Saudi Arabia,2023-08-29 19:53:53,True,False,Saudi Arabia,NaN,NaN,NaN,Accenture,NaN,NaN
284542,Data Scientist,Data Scientist,"East Jakarta, East Jakarta City, Jakarta, Indo...",via Glints,Full-time,False,Indonesia,2023-08-03 07:18:35,False,False,Indonesia,NaN,NaN,NaN,PT Sigma Global Teknologi,"['sql', 'nosql', 'sas', 'sas', 'java', 'python...","{'analyst_tools': ['sas'], 'libraries': ['hado..."
121087,Data Scientist,ML Engineer / Data Scientist (m/w/d),"Kassel, Germany",via Heise Jobs,Full-time,False,Germany,2023-10-02 08:37:00,False,False,Germany,NaN,NaN,NaN,Hessisches Ministerium der Finanzen,NaN,NaN
702546,Senior Data Engineer,Senior Data Engineer,"London, UK",via BeBee,Full-time,False,United Kingdom,2023-09-23 03:14:20,True,False,United Kingdom,NaN,NaN,NaN,"Spendesk, Inc.","['python', 'sql', 'airflow', 'kubernetes', 'te...","{'libraries': ['airflow'], 'other': ['kubernet..."
159233,Data Analyst,Environmental Data Analyst,"Cambridge, ON, Canada",via LinkedIn,Full-time,False,Canada,2023-11-10 08:31:12,False,False,Canada,NaN,NaN,NaN,Geosyntec Consultants,"['r', 'python', 'sql']","{'programming': ['r', 'python', 'sql']}"
352266,Data Engineer,Lead Data Engineer - Remote,Anywhere,via Recruit.net,Full-time,True,United Kingdom,2023-02-01 23:55:04,True,False,United Kingdom,NaN,NaN,NaN,buckleighwilliams Tonic,"['ssrs', 'tableau', 'looker']","{'analyst_tools': ['ssrs', 'tableau', 'looker']}"
660778,Cloud Engineer,Junior Web Analyst,Italy,via BeBee,Full-time,False,Italy,2023-10-27 10:15:54,True,False,Italy,NaN,NaN,NaN,Confidenziale,NaN,NaN
69497,Senior Data Analyst,Senior Data Analyst,"Buenos Aires, Argentina",via BeBee,Full-time,False,Argentina,2023-07-21 06:42:24,True,False,Argentina,NaN,NaN,NaN,In All Media,"['python', 'sql', 'aws', 'redshift', 'snowflak...","{'analyst_tools': ['tableau', 'power bi'], 'cl..."
137539,Data Scientist,Data Scientist - Now Hiring,Anywhere,via Snagajob,Full-time,True,"California, United States",2023-02-24 08:03:10,False,True,United States,NaN,NaN,NaN,Jobot,"['go', 'sql']","{'programming': ['go', 'sql']}"
42242,Data Scientist,Data Scientist - Top Secret/SCI with Full Scop...,"McLean, VA",via LinkedIn,Full-time,False,Georgia,2023-10-13 07:15:12,False,True,United States,NaN,NaN,NaN,Pendulum,"['python', 'sql', 'aws', 'git', 'github', 'jira']","{'async': ['jira'], 'cloud': ['aws'], 'other':..."
126067,Data Engineer,Data Engineer(AWS),"Bangkok, Thailand",via Blognone Jobs,Full-time,False,Thailand,2023-03-22 08:27:23,True,False,Thailand,NaN,NaN,NaN,"Adastra (Thailand) Co., Ltd.","['python', 'sql', 'aws', 'redshift', 'spark', ...","{'cloud': ['aws', 'redshift'], 'libraries': ['..."
701304,Data Analyst,Data Analyst for George,"Vienna, Austria",via BeBee,Full-time,False,Austria,2023-05-09 03:47:08,True,False,Austria,NaN,NaN,NaN,Erste Digital,NaN,NaN

In [35]:
jobs["salary_year_avg"] = jobs["salary_year_avg"].fillna(jobs["salary_year_avg"].mean())

In [36]:
jobs.sample(20)

,job_title_short,job_title,job_location,job_via,job_schedule_type,job_work_from_home,search_location,job_posted_date,job_no_degree_mention,job_health_insurance,job_country,salary_rate,salary_year_avg,salary_hour_avg,company_name,job_skills,job_type_skills
766112,Data Engineer,Data Engineer (Remote),Anywhere,via Built In,Full-time,True,"Texas, United States",2023-02-28 01:06:06,True,True,United States,NaN,123286.274072,NaN,Metronome LLC,"['sql', 'java', 'python', 'typescript', 'snowf...","{'analyst_tools': ['looker'], 'cloud': ['snowf..."
406087,Software Engineer,Junior Engineer,Saudi Arabia,via BeBee,Full-time,False,Saudi Arabia,2023-08-07 16:57:17,True,False,Saudi Arabia,NaN,123286.274072,NaN,SNC-Lavalin Fayez Engineering,"['sap', 'excel', 'ms access']","{'analyst_tools': ['sap', 'excel', 'ms access']}"
417309,Data Analyst,CRM Analytics Engineer,Anywhere,via LinkedIn,Contractor,True,Canada,2023-03-23 16:30:06,False,False,Canada,NaN,123286.274072,NaN,SRA Staffing - SRA Group,['sql'],{'programming': ['sql']}
655735,Data Scientist,"Manager, Statistical Data Sciences Lead","Athens, Greece",via LinkedIn,Full-time,False,Greece,2023-03-30 10:14:56,False,False,Greece,NaN,123286.274072,NaN,Pfizer,"['sas', 'sas', 'r', 'python']","{'analyst_tools': ['sas'], 'programming': ['sa..."
448956,Data Analyst,Data Analyst Manager,"Preston, UK",via Your Basin Jobs,Full-time,False,United Kingdom,2023-04-12 14:35:24,True,False,United Kingdom,NaN,123286.274072,NaN,RSM,"['azure', 'power bi', 'excel', 'alteryx']","{'analyst_tools': ['power bi', 'excel', 'alter..."
649760,Data Scientist,Sr. Data Scientist,"Rose Hill, VA",via BeBee,Full-time,False,"New York, United States",2023-09-13 10:02:17,False,True,United States,NaN,123286.274072,NaN,Stanley Reid & Company,"['python', 'r', 'aws', 'tidyverse', 'git']","{'cloud': ['aws'], 'libraries': ['tidyverse'],..."
615483,Senior Data Scientist,Senior Data Scientist,"Paris, France",via BeBee,Full-time,False,France,2023-05-28 12:37:39,False,False,France,NaN,123286.274072,NaN,Equativ,"['python', 'java', 'scala', 'c++', 'c#', 'gcp'...","{'cloud': ['gcp', 'bigquery'], 'libraries': ['..."
247556,Software Engineer,Staff Software Engineer - Data Platform,"Brno, Czechia",via Indeed.cz,Full-time,False,Czechia,2023-10-19 08:05:26,True,False,Czechia,NaN,123286.274072,NaN,SentinelOne,"['java', 'scala', 'go', 'python', 'rust', 'red...","{'cloud': ['aws', 'gcp'], 'databases': ['redis..."
161447,Senior Data Engineer,Senior Python Data Engineer,"Houston, TX",via LinkedIn,Full-time,False,"Texas, United States",2023-02-01 15:48:11,False,False,United States,NaN,123286.274072,NaN,"Integrated Resources, Inc ( IRI )","['sql', 'mongo', 'python', 'sql server', 'cass...","{'cloud': ['snowflake', 'aws', 'redshift', 'or..."
425033,Data Analyst,Data Analyst,"San Jose, CA",via Trabajo.org,Full-time,False,"California, United States",2023-02-12 16:00:36,False,False,United States,NaN,123286.274072,NaN,Expedite Technology Solutions,['tableau'],{'analyst_tools': ['tableau']}
104234,Data Analyst,Data Analyst,"Dallas, TX",via ViewAndApply,Full-time,False,"Texas, United States",2023-09-13 00:01:31,False,True,United States,NaN,123286.274072,NaN,Guidehouse,"['splunk', 'tableau']","{'analyst_tools': ['splunk', 'tableau']}"
590301,Data Scientist,Data Scientist,"Brussels, Belgium",via LinkedIn Belgium,Full-time,False,Belgium,2023-02-09 09:36:55,False,False,Belgium,NaN,123286.274072,NaN,twenty8,"['r', 'python', 'perl', 'sql', 'nosql', 'mongo...","{'databases': ['mongodb'], 'libraries': ['hado..."
243431,Data Engineer,Enterprise- CIBMTR Data Engineer,"Milwaukee, WI",via ZipRecruiter,Full-time,False,"New York, United States",2023-05-03 07:28:04,True,False,United States,NaN,123286.274072,NaN,Medical College of Wisconsin,"['sql', 'r', 'sas', 'sas', 'perl', 'python', '...","{'analyst_tools': ['sas'], 'programming': ['sq..."
744078,Senior Data Engineer,Senior Data Engineer,"Plano, TX",via Indeed,Full-time,False,"New York, United States",2023-03-11 20:07:34,False,True,United States,NaN,123286.274072,NaN,Capital One,"['java', 'scala', 'python', 'nosql', 'sql', 'm...","{'cloud': ['redshift', 'snowflake', 'aws', 'az..."
317092,Data Engineer,Data Engineer,"Kyiv, Ukraine",via Robota.ua,Full-time,False,Ukraine,2023-11-22 17:57:15,True,False,Ukraine,NaN,123286.274072,NaN,PIN-UP.BUSINESS,"['sql', 'python', 'gitlab']","{'other': ['gitlab'], 'programming': ['sql', '..."
779793,Data Analyst,Data Analyst,"Moline, IL",via ZipRecruiter,Full-time,False,"Illinois, United States",2023-01-26 05:01:53,True,False,United States,NaN,123286.274072,NaN,Sunrise Systems Inc,"['sas', 'sas', 'r', 'db2', 'tableau']","{'analyst_tools': ['sas', 'tableau'], 'databas..."
264807,Data Analyst,Data And Reporting Analyst,"Edinburgh, UK",via LinkedIn,Full-time,False,United Kingdom,2023-01-06 07:28:13,True,False,United Kingdom,NaN,123286.274072,NaN,Atos,"['power bi', 'excel']","{'analyst_tools': ['power bi', 'excel']}"
172531,Data Engineer,Big Data Engineer/Data Engineer(Only W2 or Sel...,"Dallas, TX",via Dice.com,Contractor,False,"Florida, United States",2023-07-20 15:10:58,True,False,United States,NaN,123286.274072,NaN,Newt Global,['python'],{'programming': ['python']}
281058,Data Engineer,Data Engineer / Tech Lead,"Barcelona, Spain",via LinkedIn,Full-time,False,Spain,2023-09-08 07:57:56,True,False,Spain,NaN,123286.274072,NaN,HOLA CONSULTORES SL,"['sql', 'c', 'sql server']","{'databases': ['sql server'], 'programming': [..."
494958,Data Scientist,Data Scientist,"Amsterdam, Netherlands",via BeBee Nederland,Full-time,False,Netherlands,2023-05-01 11:22:18,False,False,Netherlands,NaN,123286.274072,NaN,Vattenfall,"['python', 'sql', 'azure', 'docker']","{'cloud': ['azure'], 'other': ['docker'], 'pro..."

In [39]:
jobs = jobs.dropna(subset=["salary_year_avg"])

In [40]:
jobs.info()

<class 'pandas.core.frame.DataFrame'>
Index: 22003 entries, 28 to 785692
Data columns (total 17 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   job_title_short        22003 non-null  object
 1   job_title              22003 non-null  object
 2   job_location           21723 non-null  object
 3   job_via                22003 non-null  object
 4   job_schedule_type      21987 non-null  object
 5   job_work_from_home     22003 non-null  bool
 6   search_location        22003 non-null  object
 7   job_posted_date        22003 non-null  object
 8   job_no_degree_mention  22003 non-null  bool
 9   job_health_insurance   22003 non-null  bool
 10  job_country            22003 non-null  object
 11  salary_rate            22003 non-null  object
 12  salary_year_avg        22003 non-null  float64
 13  salary_hour_avg        0 non-null      float64
 14  company_name           22003 non-null  object
 15  job_skills             20170 non-null  object
 16  job_type_skills        20170 non-null  object
dtypes: bool(3), float64(2), object(12)
memory usage: 2.6+ MB

In [48]:
null_salary = jobs[jobs.isnull().any(axis=1)].copy()

In [49]:
null_salary.info()

<class 'pandas.core.frame.DataFrame'>
Index: 22003 entries, 28 to 785692
Data columns (total 17 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   job_title_short        22003 non-null  object
 1   job_title              22003 non-null  object
 2   job_location           21723 non-null  object
 3   job_via                22003 non-null  object
 4   job_schedule_type      21987 non-null  object
 5   job_work_from_home     22003 non-null  bool
 6   search_location        22003 non-null  object
 7   job_posted_date        22003 non-null  object
 8   job_no_degree_mention  22003 non-null  bool
 9   job_health_insurance   22003 non-null  bool
 10  job_country            22003 non-null  object
 11  salary_rate            22003 non-null  object
 12  salary_year_avg        22003 non-null  float64
 13  salary_hour_avg        0 non-null      float64
 14  company_name           22003 non-null  object
 15  job_skills             20170 non-null  object
 16  job_type_skills        20170 non-null  object
dtypes: bool(3), float64(2), object(12)
memory usage: 2.6+ MB

In [50]:
null_salary.isnull().sum()

job_title_short              0
job_title                    0
job_location               280
job_via                      0
job_schedule_type           16
job_work_from_home           0
search_location              0
job_posted_date              0
job_no_degree_mention        0
job_health_insurance         0
job_country                  0
salary_rate                  0
salary_year_avg              0
salary_hour_avg          22003
company_name                 0
job_skills                1833
job_type_skills           1833
dtype: int64

In [51]:
null_salary["salary_hour_avg"] = null_salary["salary_hour_avg"].fillna(null_salary["salary_year_avg"]/1920)

In [52]:
null_salary.head()

,job_title_short,job_title,job_location,job_via,job_schedule_type,job_work_from_home,search_location,job_posted_date,job_no_degree_mention,job_health_insurance,job_country,salary_rate,salary_year_avg,salary_hour_avg,company_name,job_skills,job_type_skills
28,Data Scientist,CRM Data Specialist,"San José Province, San José, Costa Rica",via Ai-Jobs.net,Full-time,False,Costa Rica,2023-08-01 13:37:57,False,False,Costa Rica,year,109500.0,57.031250,Netskope,"['gdpr', 'excel']","{'analyst_tools': ['excel'], 'libraries': ['gd..."
77,Data Engineer,Data Engineer,"Arlington, VA",via LinkedIn,Full-time,False,Sudan,2023-06-26 14:22:54,False,False,Sudan,year,140000.0,72.916667,Intelletec,"['mongodb', 'mongodb', 'python', 'r', 'sql', '...","{'analyst_tools': ['tableau'], 'cloud': ['orac..."
92,Data Engineer,Remote - Data Engineer - Permanent - W2,Anywhere,via LinkedIn,Full-time,True,"Illinois, United States",2023-02-21 13:29:59,False,True,United States,year,120000.0,62.500000,Apex Systems,"['sql', 'python']","{'programming': ['sql', 'python']}"
100,Data Scientist,"Data Scientist, Risk Data Mining - USDS","Mountain View, CA",via LinkedIn,Full-time,False,"California, United States",2023-07-31 13:01:18,False,True,United States,year,228222.0,118.865625,TikTok,"['sql', 'r', 'python', 'express']","{'programming': ['sql', 'r', 'python'], 'webfr..."
109,Data Analyst,Senior Supply Chain Analytics Analyst,Anywhere,via Get.It,Full-time,True,"Illinois, United States",2023-10-12 13:02:19,False,True,United States,year,89000.0,46.354167,Get It Recruit - Transportation,"['python', 'r', 'alteryx', 'tableau']","{'analyst_tools': ['alteryx', 'tableau'], 'pro..."

In [53]:
null_salary["salary_hour_avg"] = null_salary["salary_hour_avg"].round(2)

In [54]:
null_salary.head()

,job_title_short,job_title,job_location,job_via,job_schedule_type,job_work_from_home,search_location,job_posted_date,job_no_degree_mention,job_health_insurance,job_country,salary_rate,salary_year_avg,salary_hour_avg,company_name,job_skills,job_type_skills
28,Data Scientist,CRM Data Specialist,"San José Province, San José, Costa Rica",via Ai-Jobs.net,Full-time,False,Costa Rica,2023-08-01 13:37:57,False,False,Costa Rica,year,109500.0,57.03,Netskope,"['gdpr', 'excel']","{'analyst_tools': ['excel'], 'libraries': ['gd..."
77,Data Engineer,Data Engineer,"Arlington, VA",via LinkedIn,Full-time,False,Sudan,2023-06-26 14:22:54,False,False,Sudan,year,140000.0,72.92,Intelletec,"['mongodb', 'mongodb', 'python', 'r', 'sql', '...","{'analyst_tools': ['tableau'], 'cloud': ['orac..."
92,Data Engineer,Remote - Data Engineer - Permanent - W2,Anywhere,via LinkedIn,Full-time,True,"Illinois, United States",2023-02-21 13:29:59,False,True,United States,year,120000.0,62.50,Apex Systems,"['sql', 'python']","{'programming': ['sql', 'python']}"
100,Data Scientist,"Data Scientist, Risk Data Mining - USDS","Mountain View, CA",via LinkedIn,Full-time,False,"California, United States",2023-07-31 13:01:18,False,True,United States,year,228222.0,118.87,TikTok,"['sql', 'r', 'python', 'express']","{'programming': ['sql', 'r', 'python'], 'webfr..."
109,Data Analyst,Senior Supply Chain Analytics Analyst,Anywhere,via Get.It,Full-time,True,"Illinois, United States",2023-10-12 13:02:19,False,True,United States,year,89000.0,46.35,Get It Recruit - Transportation,"['python', 'r', 'alteryx', 'tableau']","{'analyst_tools': ['alteryx', 'tableau'], 'pro..."

In [55]:
jobs.update(null_salary)

In [57]:
jobs.info()

<class 'pandas.core.frame.DataFrame'>
Index: 22003 entries, 28 to 785692
Data columns (total 17 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   job_title_short        22003 non-null  object
 1   job_title              22003 non-null  object
 2   job_location           21723 non-null  object
 3   job_via                22003 non-null  object
 4   job_schedule_type      21987 non-null  object
 5   job_work_from_home     22003 non-null  bool
 6   search_location        22003 non-null  object
 7   job_posted_date        22003 non-null  object
 8   job_no_degree_mention  22003 non-null  bool
 9   job_health_insurance   22003 non-null  bool
 10  job_country            22003 non-null  object
 11  salary_rate            22003 non-null  object
 12  salary_year_avg        22003 non-null  float64
 13  salary_hour_avg        22003 non-null  float64
 14  company_name           22003 non-null  object
 15  job_skills             20170 non-null  object
 16  job_type_skills        20170 non-null  object
dtypes: bool(3), float64(2), object(12)
memory usage: 2.6+ MB

In [58]:
jobs.isnull().sum()

job_title_short             0
job_title                   0
job_location              280
job_via                     0
job_schedule_type          16
job_work_from_home          0
search_location             0
job_posted_date             0
job_no_degree_mention       0
job_health_insurance        0
job_country                 0
salary_rate                 0
salary_year_avg             0
salary_hour_avg             0
company_name                0
job_skills               1833
job_type_skills          1833
dtype: int64

In [60]:
jobs["job_skills"] = jobs["job_skills"].ffill()

In [61]:
jobs["job_type_skills"] = jobs["job_type_skills"].bfill()

In [62]:
jobs.isnull().sum()

job_title_short            0
job_title                  0
job_location             280
job_via                    0
job_schedule_type         16
job_work_from_home         0
search_location            0
job_posted_date            0
job_no_degree_mention      0
job_health_insurance       0
job_country                0
salary_rate                0
salary_year_avg            0
salary_hour_avg            0
company_name               0
job_skills                 0
job_type_skills            0
dtype: int64

In [64]:
jobs.dropna(subset=["job_location", "job_schedule_type"], inplace=True)

In [65]:
jobs.isnull().sum()

job_title_short          0
job_title                0
job_location             0
job_via                  0
job_schedule_type        0
job_work_from_home       0
search_location          0
job_posted_date          0
job_no_degree_mention    0
job_health_insurance     0
job_country              0
salary_rate              0
salary_year_avg          0
salary_hour_avg          0
company_name             0
job_skills               0
job_type_skills          0
dtype: int64

In [67]:
jobs.to_csv("./data/updated_jobs.csv")

In [2]:
jobs = pd.read_csv("./data/updated_jobs.csv")

NameError: name 'pd' is not defined

In [69]:
jobs.head()

,Unnamed: 0,job_title_short,job_title,job_location,job_via,job_schedule_type,job_work_from_home,search_location,job_posted_date,job_no_degree_mention,job_health_insurance,job_country,salary_rate,salary_year_avg,salary_hour_avg,company_name,job_skills,job_type_skills
0,28,Data Scientist,CRM Data Specialist,"San José Province, San José, Costa Rica",via Ai-Jobs.net,Full-time,False,Costa Rica,2023-08-01 13:37:57,False,False,Costa Rica,year,109500.0,57.03,Netskope,"['gdpr', 'excel']","{'analyst_tools': ['excel'], 'libraries': ['gd..."
1,77,Data Engineer,Data Engineer,"Arlington, VA",via LinkedIn,Full-time,False,Sudan,2023-06-26 14:22:54,False,False,Sudan,year,140000.0,72.92,Intelletec,"['mongodb', 'mongodb', 'python', 'r', 'sql', '...","{'analyst_tools': ['tableau'], 'cloud': ['orac..."
2,92,Data Engineer,Remote - Data Engineer - Permanent - W2,Anywhere,via LinkedIn,Full-time,True,"Illinois, United States",2023-02-21 13:29:59,False,True,United States,year,120000.0,62.50,Apex Systems,"['sql', 'python']","{'programming': ['sql', 'python']}"
3,100,Data Scientist,"Data Scientist, Risk Data Mining - USDS","Mountain View, CA",via LinkedIn,Full-time,False,"California, United States",2023-07-31 13:01:18,False,True,United States,year,228222.0,118.87,TikTok,"['sql', 'r', 'python', 'express']","{'programming': ['sql', 'r', 'python'], 'webfr..."
4,109,Data Analyst,Senior Supply Chain Analytics Analyst,Anywhere,via Get.It,Full-time,True,"Illinois, United States",2023-10-12 13:02:19,False,True,United States,year,89000.0,46.35,Get It Recruit - Transportation,"['python', 'r', 'alteryx', 'tableau']","{'analyst_tools': ['alteryx', 'tableau'], 'pro..."

In [70]:
jobs.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 21707 entries, 0 to 21706
Data columns (total 18 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   Unnamed: 0             21707 non-null  int64
 1   job_title_short        21707 non-null  object
 2   job_title              21707 non-null  object
 3   job_location           21707 non-null  object
 4   job_via                21707 non-null  object
 5   job_schedule_type      21707 non-null  object
 6   job_work_from_home     21707 non-null  bool
 7   search_location        21707 non-null  object
 8   job_posted_date        21707 non-null  object
 9   job_no_degree_mention  21707 non-null  bool
 10  job_health_insurance   21707 non-null  bool
 11  job_country            21707 non-null  object
 12  salary_rate            21707 non-null  object
 13  salary_year_avg        21707 non-null  float64
 14  salary_hour_avg        21707 non-null  float64
 15  company_name           21707 non-null  object
 16  job_skills             21707 non-null  object
 17  job_type_skills        21707 non-null  object
dtypes: bool(3), float64(2), int64(1), object(12)
memory usage: 2.5+ MB

In [71]:
jobs.dropna()

,Unnamed: 0,job_title_short,job_title,job_location,job_via,job_schedule_type,job_work_from_home,search_location,job_posted_date,job_no_degree_mention,job_health_insurance,job_country,salary_rate,salary_year_avg,salary_hour_avg,company_name,job_skills,job_type_skills
0,28,Data Scientist,CRM Data Specialist,"San José Province, San José, Costa Rica",via Ai-Jobs.net,Full-time,False,Costa Rica,2023-08-01 13:37:57,False,False,Costa Rica,year,109500.0,57.03,Netskope,"['gdpr', 'excel']","{'analyst_tools': ['excel'], 'libraries': ['gd..."
1,77,Data Engineer,Data Engineer,"Arlington, VA",via LinkedIn,Full-time,False,Sudan,2023-06-26 14:22:54,False,False,Sudan,year,140000.0,72.92,Intelletec,"['mongodb', 'mongodb', 'python', 'r', 'sql', '...","{'analyst_tools': ['tableau'], 'cloud': ['orac..."
2,92,Data Engineer,Remote - Data Engineer - Permanent - W2,Anywhere,via LinkedIn,Full-time,True,"Illinois, United States",2023-02-21 13:29:59,False,True,United States,year,120000.0,62.50,Apex Systems,"['sql', 'python']","{'programming': ['sql', 'python']}"
3,100,Data Scientist,"Data Scientist, Risk Data Mining - USDS","Mountain View, CA",via LinkedIn,Full-time,False,"California, United States",2023-07-31 13:01:18,False,True,United States,year,228222.0,118.87,TikTok,"['sql', 'r', 'python', 'express']","{'programming': ['sql', 'r', 'python'], 'webfr..."
4,109,Data Analyst,Senior Supply Chain Analytics Analyst,Anywhere,via Get.It,Full-time,True,"Illinois, United States",2023-10-12 13:02:19,False,True,United States,year,89000.0,46.35,Get It Recruit - Transportation,"['python', 'r', 'alteryx', 'tableau']","{'analyst_tools': ['alteryx', 'tableau'], 'pro..."
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
21702,785624,Data Engineer,Data Analytics Engineer (Hybrid),"Mt Prospect, IL",via Ai-Jobs.net,Full-time,False,"Illinois, United States",2023-08-31 06:02:16,False,True,United States,year,139216.0,72.51,Bosch Group,"['go', 'python', 'r', 'sql', 'oracle', 'window...","{'analyst_tools': ['alteryx', 'power bi', 'tab..."
21703,785641,Data Engineer,Data Engineer,"New York, NY",via Dice,Full-time,False,Georgia,2023-01-04 16:36:07,True,False,United States,year,150000.0,78.12,"Engage Partners, Inc.","['go', 'python', 'r', 'sql', 'oracle', 'window...","{'cloud': ['azure', 'snowflake'], 'libraries':..."
21704,785648,Data Scientist,Director Data Scientist - Commercial Platforms...,"Pleasant Hill, CA",via Ai-Jobs.net,Full-time,False,"California, United States",2023-04-12 06:02:51,False,True,United States,year,221875.0,115.56,84.51°,"['python', 'azure', 'snowflake', 'spark']","{'cloud': ['azure', 'snowflake'], 'libraries':..."
21705,785682,Data Scientist,Data Scientist für datengetriebene Entwicklung...,"Reutlingen, Germany",via Ai-Jobs.net,Full-time,False,Germany,2023-03-04 06:16:08,False,False,Germany,year,157500.0,82.03,Bosch Group,"['python', 'hadoop', 'spark', 'airflow', 'kube...","{'libraries': ['hadoop', 'spark', 'airflow'], ..."
21706,785692,Data Scientist,Data Scientist- Hybrid Work Location,"Dayton, OH",via Ai-Jobs.net,Full-time,False,"Illinois, United States",2023-04-21 06:02:31,False,True,United States,year,157500.0,82.03,Tenet3,"['python', 'matlab', 'r']","{'programming': ['python', 'matlab', 'r']}"

In [72]:
jobs.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 21707 entries, 0 to 21706
Data columns (total 18 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   Unnamed: 0             21707 non-null  int64
 1   job_title_short        21707 non-null  object
 2   job_title              21707 non-null  object
 3   job_location           21707 non-null  object
 4   job_via                21707 non-null  object
 5   job_schedule_type      21707 non-null  object
 6   job_work_from_home     21707 non-null  bool
 7   search_location        21707 non-null  object
 8   job_posted_date        21707 non-null  object
 9   job_no_degree_mention  21707 non-null  bool
 10  job_health_insurance   21707 non-null  bool
 11  job_country            21707 non-null  object
 12  salary_rate            21707 non-null  object
 13  salary_year_avg        21707 non-null  float64
 14  salary_hour_avg        21707 non-null  float64
 15  company_name           21707 non-null  object
 16  job_skills             21707 non-null  object
 17  job_type_skills        21707 non-null  object
dtypes: bool(3), float64(2), int64(1), object(12)
memory usage: 2.5+ MB

In [74]:
jobs["job_posted_date"] = pd.to_datetime(jobs["job_posted_date"])

In [75]:
jobs.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 21707 entries, 0 to 21706
Data columns (total 18 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   Unnamed: 0             21707 non-null  int64
 1   job_title_short        21707 non-null  object
 2   job_title              21707 non-null  object
 3   job_location           21707 non-null  object
 4   job_via                21707 non-null  object
 5   job_schedule_type      21707 non-null  object
 6   job_work_from_home     21707 non-null  bool
 7   search_location        21707 non-null  object
 8   job_posted_date        21707 non-null  datetime64[ns]
 9   job_no_degree_mention  21707 non-null  bool
 10  job_health_insurance   21707 non-null  bool
 11  job_country            21707 non-null  object
 12  salary_rate            21707 non-null  object
 13  salary_year_avg        21707 non-null  float64
 14  salary_hour_avg        21707 non-null  float64
 15  company_name           21707 non-null  object
 16  job_skills             21707 non-null  object
 17  job_type_skills        21707 non-null  object
dtypes: bool(3), datetime64[ns](1), float64(2), int64(1), object(11)
memory usage: 2.5+ MB

In [77]:
jobs.duplicated().sum()

np.int64(0)

In [78]:
jobs[jobs.duplicated(subset=["job_skills"])]

,Unnamed: 0,job_title_short,job_title,job_location,job_via,job_schedule_type,job_work_from_home,search_location,job_posted_date,job_no_degree_mention,job_health_insurance,job_country,salary_rate,salary_year_avg,salary_hour_avg,company_name,job_skills,job_type_skills
11,339,Data Engineer,Global Market Leading Energy Firm - Staff Data...,United States,via LinkedIn,Full-time,False,"California, United States",2023-09-22 13:07:57,False,False,United States,year,195000.0,101.56,Xcede,"['nosql', 'sql']","{'programming': ['sql', 'python']}"
12,380,Data Engineer,Snaplogic Data Engineer,"Durham, NC",via LinkedIn,Full-time,False,"Illinois, United States",2023-08-16 13:26:21,True,False,United States,year,97500.0,50.78,KTek Resourcing,"['sql', 'python']","{'programming': ['sql', 'python']}"
22,654,Data Engineer,Lead Data Engineer (DataStage) (Need only loca...,"Cincinnati, OH",via Dice.com,Contractor,False,Sudan,2023-09-22 13:38:56,True,False,Sudan,year,70000.0,36.46,Strategic Systems Inc,"['sql', 'python', 'tableau']","{'cloud': ['aws', 'redshift'], 'libraries': ['..."
38,1042,Machine Learning Engineer,Head of AML Operations (m/f/d),"Ballerup, Denmark",via Ai-Jobs.net,Full-time,False,Denmark,2023-06-14 13:25:40,False,False,Denmark,year,105300.0,54.84,Nets,"['sql', 'python', 'c#', 'java', 'javascript', ...","{'libraries': ['pyspark', 'spark'], 'programmi..."
50,1357,Data Engineer,"Data Engineer, Analytics (Generalist)","Des Moines, IA",via Relocation Jobs,Full-time,False,"Florida, United States",2023-04-14 13:30:22,False,False,United States,year,198500.0,103.39,Meta,"['sql', 'python']","{'programming': ['sql', 'python']}"
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
21697,785340,Senior Data Scientist,Senior Data Scientist - Product Analytics,"Mountain View, CA",via LinkedIn,Full-time,False,"California, United States",2023-01-11 06:20:24,False,True,United States,year,196800.0,102.50,TikTok,"['sql', 'python']","{'programming': ['sql', 'python']}"
21699,785488,Data Scientist,Data Scientist,"New York, NY",via BeBee,Full-time,False,"New York, United States",2023-11-27 06:01:23,False,False,United States,year,115000.0,59.90,Winston Fox,"['python', 'r']","{'programming': ['python', 'r']}"
21700,785515,Data Analyst,Data Analyst,"Bengaluru, Karnataka, India",via Ai-Jobs.net,Full-time,False,India,2023-09-01 06:17:34,False,False,India,year,105000.0,54.69,Myntra,"['python', 'r']","{'analyst_tools': ['word', 'power bi', 'tablea..."
21703,785641,Data Engineer,Data Engineer,"New York, NY",via Dice,Full-time,False,Georgia,2023-01-04 16:36:07,True,False,United States,year,150000.0,78.12,"Engage Partners, Inc.","['go', 'python', 'r', 'sql', 'oracle', 'window...","{'cloud': ['azure', 'snowflake'], 'libraries':..."
21704,785648,Data Scientist,Director Data Scientist - Commercial Platforms...,"Pleasant Hill, CA",via Ai-Jobs.net,Full-time,False,"California, United States",2023-04-12 06:02:51,False,True,United States,year,221875.0,115.56,84.51°,"['python', 'azure', 'snowflake', 'spark']","{'cloud': ['azure', 'snowflake'], 'libraries':..."

In [79]:
def taxes(salary_year_avg):
    if salary_year_avg <= 30000:
        return "Low"
    elif salary_year_avg<=80000:
        return "Mid"
    else:
        return "High"

In [80]:
jobs["tax_class"] = jobs["salary_year_avg"].apply(taxes)

In [81]:
jobs.head()

,Unnamed: 0,job_title_short,job_title,job_location,job_via,job_schedule_type,job_work_from_home,search_location,job_posted_date,job_no_degree_mention,job_health_insurance,job_country,salary_rate,salary_year_avg,salary_hour_avg,company_name,job_skills,job_type_skills,tax_class
0,28,Data Scientist,CRM Data Specialist,"San José Province, San José, Costa Rica",via Ai-Jobs.net,Full-time,False,Costa Rica,2023-08-01 13:37:57,False,False,Costa Rica,year,109500.0,57.03,Netskope,"['gdpr', 'excel']","{'analyst_tools': ['excel'], 'libraries': ['gd...",High
1,77,Data Engineer,Data Engineer,"Arlington, VA",via LinkedIn,Full-time,False,Sudan,2023-06-26 14:22:54,False,False,Sudan,year,140000.0,72.92,Intelletec,"['mongodb', 'mongodb', 'python', 'r', 'sql', '...","{'analyst_tools': ['tableau'], 'cloud': ['orac...",High
2,92,Data Engineer,Remote - Data Engineer - Permanent - W2,Anywhere,via LinkedIn,Full-time,True,"Illinois, United States",2023-02-21 13:29:59,False,True,United States,year,120000.0,62.50,Apex Systems,"['sql', 'python']","{'programming': ['sql', 'python']}",High
3,100,Data Scientist,"Data Scientist, Risk Data Mining - USDS","Mountain View, CA",via LinkedIn,Full-time,False,"California, United States",2023-07-31 13:01:18,False,True,United States,year,228222.0,118.87,TikTok,"['sql', 'r', 'python', 'express']","{'programming': ['sql', 'r', 'python'], 'webfr...",High
4,109,Data Analyst,Senior Supply Chain Analytics Analyst,Anywhere,via Get.It,Full-time,True,"Illinois, United States",2023-10-12 13:02:19,False,True,United States,year,89000.0,46.35,Get It Recruit - Transportation,"['python', 'r', 'alteryx', 'tableau']","{'analyst_tools': ['alteryx', 'tableau'], 'pro...",High

In [87]:
jobs.groupby("job_country").agg({
    "salary_year_avg": ["mean", "max", "min"]
})

            salary_year_avg
                       mean       max      min
job_country
Albania        79472.500000  157500.0  43200.0
Algeria        44550.000000   45000.0  44100.0
Argentina     105212.343750  222000.0  45000.0
Armenia        78757.000000  128682.0  45000.0
Australia     118987.574324  257500.0  20000.0
...                     ...       ...      ...
Uruguay        69333.333333  100500.0  50000.0
Uzbekistan     30750.000000   30750.0  30750.0
Vietnam        90927.236364  200000.0  28000.0
Zambia         90670.000000   90670.0  90670.0
Zimbabwe       67056.666667   90670.0  47500.0

[108 rows x 3 columns]

In [88]:
jobs.reset_index()

,index,Unnamed: 0,job_title_short,job_title,job_location,job_via,job_schedule_type,job_work_from_home,search_location,job_posted_date,job_no_degree_mention,job_health_insurance,job_country,salary_rate,salary_year_avg,salary_hour_avg,company_name,job_skills,job_type_skills,tax_class
0,0,28,Data Scientist,CRM Data Specialist,"San José Province, San José, Costa Rica",via Ai-Jobs.net,Full-time,False,Costa Rica,2023-08-01 13:37:57,False,False,Costa Rica,year,109500.0,57.03,Netskope,"['gdpr', 'excel']","{'analyst_tools': ['excel'], 'libraries': ['gd...",High
1,1,77,Data Engineer,Data Engineer,"Arlington, VA",via LinkedIn,Full-time,False,Sudan,2023-06-26 14:22:54,False,False,Sudan,year,140000.0,72.92,Intelletec,"['mongodb', 'mongodb', 'python', 'r', 'sql', '...","{'analyst_tools': ['tableau'], 'cloud': ['orac...",High
2,2,92,Data Engineer,Remote - Data Engineer - Permanent - W2,Anywhere,via LinkedIn,Full-time,True,"Illinois, United States",2023-02-21 13:29:59,False,True,United States,year,120000.0,62.50,Apex Systems,"['sql', 'python']","{'programming': ['sql', 'python']}",High
3,3,100,Data Scientist,"Data Scientist, Risk Data Mining - USDS","Mountain View, CA",via LinkedIn,Full-time,False,"California, United States",2023-07-31 13:01:18,False,True,United States,year,228222.0,118.87,TikTok,"['sql', 'r', 'python', 'express']","{'programming': ['sql', 'r', 'python'], 'webfr...",High
4,4,109,Data Analyst,Senior Supply Chain Analytics Analyst,Anywhere,via Get.It,Full-time,True,"Illinois, United States",2023-10-12 13:02:19,False,True,United States,year,89000.0,46.35,Get It Recruit - Transportation,"['python', 'r', 'alteryx', 'tableau']","{'analyst_tools': ['alteryx', 'tableau'], 'pro...",High
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
21702,21702,785624,Data Engineer,Data Analytics Engineer (Hybrid),"Mt Prospect, IL",via Ai-Jobs.net,Full-time,False,"Illinois, United States",2023-08-31 06:02:16,False,True,United States,year,139216.0,72.51,Bosch Group,"['go', 'python', 'r', 'sql', 'oracle', 'window...","{'analyst_tools': ['alteryx', 'power bi', 'tab...",High
21703,21703,785641,Data Engineer,Data Engineer,"New York, NY",via Dice,Full-time,False,Georgia,2023-01-04 16:36:07,True,False,United States,year,150000.0,78.12,"Engage Partners, Inc.","['go', 'python', 'r', 'sql', 'oracle', 'window...","{'cloud': ['azure', 'snowflake'], 'libraries':...",High
21704,21704,785648,Data Scientist,Director Data Scientist - Commercial Platforms...,"Pleasant Hill, CA",via Ai-Jobs.net,Full-time,False,"California, United States",2023-04-12 06:02:51,False,True,United States,year,221875.0,115.56,84.51°,"['python', 'azure', 'snowflake', 'spark']","{'cloud': ['azure', 'snowflake'], 'libraries':...",High
21705,21705,785682,Data Scientist,Data Scientist für datengetriebene Entwicklung...,"Reutlingen, Germany",via Ai-Jobs.net,Full-time,False,Germany,2023-03-04 06:16:08,False,False,Germany,year,157500.0,82.03,Bosch Group,"['python', 'hadoop', 'spark', 'airflow', 'kube...","{'libraries': ['hadoop', 'spark', 'airflow'], ...",High
21706,21706,785692,Data Scientist,Data Scientist- Hybrid Work Location,"Dayton, OH",via Ai-Jobs.net,Full-time,False,"Illinois, United States",2023-04-21 06:02:31,False,True,United States,year,157500.0,82.03,Tenet3,"['python', 'matlab', 'r']","{'programming': ['python', 'matlab', 'r']}",High

In [92]:
jobs.groupby("job_title")["salary_year_avg"].agg(["min", "mean", "max"])

,min,mean,max
job_title,,,
#10049 - Sr. Data Scientist,147500.0,147500.0,147500.0
#10128 - Data Analytics Roadmap Manager,165000.0,165000.0,165000.0
"#10294#1-Data Architect ( ETL , DevOps, data migration)",165000.0,165000.0,165000.0
#10965 Junior Data Analyst,57500.0,57500.0,57500.0
#569 Data Engineer Jr.,97444.0,97444.0,97444.0
...,...,...,...
senior analyst - data management .,115000.0,115000.0,115000.0
"シニアビジネスインテリジェンスエンジニア | Sr. Business Intelligence Engineer, Amazon...",79200.0,79200.0,79200.0
機械学習エンジニア（Machine Learning Engineer）,190000.0,190000.0,190000.0
"財務・経営企画/Business Intelligence Engineer, Japan Operations Finance",79200.0,79200.0,79200.0
🦸Research Engineer/ Data Scientist,175000.0,175000.0,175000.0

In [93]:
jobs["company_name"].value_counts()

company_name
Jobot                                       335
Capital One                                 281
Booz Allen Hamilton                         273
Robert Half                                 258
Insight Global                              249
                                           ...
RedLight                                      1
West Asset Management                         1
Stylitics                                     1
PetSmart                                      1
Virginia Dept of Social Services - Local      1
Name: count, Length: 7246, dtype: int64

In [96]:
jobs.groupby("company_name")["salary_year_avg"].agg(["min", "max", "mean"])

,min,max,mean
company_name,,,
#twiceasnice Recruiting,61000.000000,120000.000000,77750.000000
/dev/color,125000.000000,125000.000000,125000.000000
0nward Select,92500.000000,92500.000000,92500.000000
1 Point System,137290.484375,137290.484375,137290.484375
1 Point System LLC.,170000.000000,170000.000000,170000.000000
...,...,...,...
zooplus SE,157500.000000,166000.000000,161750.000000
ztp,95000.000000,95000.000000,95000.000000
ЛАНИТ,400000.000000,400000.000000,400000.000000
Технологическая компания,280000.000000,280000.000000,280000.000000
​Illinois State Board of Education,62536.000000,62536.000000,62536.000000

In [101]:
jobs.groupby("job_location")["job_work_from_home"].count()

job_location
A Coruña, Spain                    2
Aarhus, Denmark                    1
Abell, MD                          1
Aberdeen Proving Ground, MD        4
Aberdeen, MD                       7
                                  ..
Zwolle, Netherlands                2
Zürich, Switzerland               14
Zürich, Switzerland (+1 other)     1
İstanbul, Türkiye                 12
Łódź, Poland                       1
Name: job_work_from_home, Length: 2052, dtype: int64

In [99]:
jobs.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 21707 entries, 0 to 21706
Data columns (total 19 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   Unnamed: 0             21707 non-null  int64
 1   job_title_short        21707 non-null  object
 2   job_title              21707 non-null  object
 3   job_location           21707 non-null  object
 4   job_via                21707 non-null  object
 5   job_schedule_type      21707 non-null  object
 6   job_work_from_home     21707 non-null  bool
 7   search_location        21707 non-null  object
 8   job_posted_date        21707 non-null  datetime64[ns]
 9   job_no_degree_mention  21707 non-null  bool
 10  job_health_insurance   21707 non-null  bool
 11  job_country            21707 non-null  object
 12  salary_rate            21707 non-null  object
 13  salary_year_avg        21707 non-null  float64
 14  salary_hour_avg        21707 non-null  float64
 15  company_name           21707 non-null  object
 16  job_skills             21707 non-null  object
 17  job_type_skills        21707 non-null  object
 18  tax_class              21707 non-null  object
dtypes: bool(3), datetime64[ns](1), float64(2), int64(1), object(12)
memory usage: 2.7+ MB

In [104]:
jobs.groupby(["job_location", "job_title"])["salary_year_avg"].mean().head()

job_location                 job_title
A Coruña, Spain              Cloud DevSecOps Engineer      125253.0
                             Cloud SysSecOps Engineer       56700.0
Aarhus, Denmark              Data Management Consultant     56700.0
Abell, MD                    Senior Data Scientist         166075.0
Aberdeen Proving Ground, MD  Data Scientist                160000.0
Name: salary_year_avg, dtype: float64

In [ ]:
industry_avg = jobs["salary_year_avg"].mean()

In [106]:
company = jobs.groupby("company_name")["salary_year_avg"].mean()

In [107]:
top_companies = company > industry_avg

In [108]:
print(top_companies)

company_name
#twiceasnice Recruiting               False
/dev/color                             True
0nward Select                         False
1 Point System                         True
1 Point System LLC.                    True
                                      ...
zooplus SE                             True
ztp                                   False
ЛАНИТ                                  True
Технологическая компания               True
​Illinois State Board of Education    False
Name: salary_year_avg, Length: 7246, dtype: bool

In [5]:
jobs.reset_index()

,index,Unnamed: 0,job_title_short,job_title,job_location,job_via,job_schedule_type,job_work_from_home,search_location,job_posted_date,job_no_degree_mention,job_health_insurance,job_country,salary_rate,salary_year_avg,salary_hour_avg,company_name,job_skills,job_type_skills
0,0,28,Data Scientist,CRM Data Specialist,"San José Province, San José, Costa Rica",via Ai-Jobs.net,Full-time,False,Costa Rica,2023-08-01 13:37:57,False,False,Costa Rica,year,109500.0,57.03,Netskope,"['gdpr', 'excel']","{'analyst_tools': ['excel'], 'libraries': ['gd..."
1,1,77,Data Engineer,Data Engineer,"Arlington, VA",via LinkedIn,Full-time,False,Sudan,2023-06-26 14:22:54,False,False,Sudan,year,140000.0,72.92,Intelletec,"['mongodb', 'mongodb', 'python', 'r', 'sql', '...","{'analyst_tools': ['tableau'], 'cloud': ['orac..."
2,2,92,Data Engineer,Remote - Data Engineer - Permanent - W2,Anywhere,via LinkedIn,Full-time,True,"Illinois, United States",2023-02-21 13:29:59,False,True,United States,year,120000.0,62.50,Apex Systems,"['sql', 'python']","{'programming': ['sql', 'python']}"
3,3,100,Data Scientist,"Data Scientist, Risk Data Mining - USDS","Mountain View, CA",via LinkedIn,Full-time,False,"California, United States",2023-07-31 13:01:18,False,True,United States,year,228222.0,118.87,TikTok,"['sql', 'r', 'python', 'express']","{'programming': ['sql', 'r', 'python'], 'webfr..."
4,4,109,Data Analyst,Senior Supply Chain Analytics Analyst,Anywhere,via Get.It,Full-time,True,"Illinois, United States",2023-10-12 13:02:19,False,True,United States,year,89000.0,46.35,Get It Recruit - Transportation,"['python', 'r', 'alteryx', 'tableau']","{'analyst_tools': ['alteryx', 'tableau'], 'pro..."
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
21702,21702,785624,Data Engineer,Data Analytics Engineer (Hybrid),"Mt Prospect, IL",via Ai-Jobs.net,Full-time,False,"Illinois, United States",2023-08-31 06:02:16,False,True,United States,year,139216.0,72.51,Bosch Group,"['go', 'python', 'r', 'sql', 'oracle', 'window...","{'analyst_tools': ['alteryx', 'power bi', 'tab..."
21703,21703,785641,Data Engineer,Data Engineer,"New York, NY",via Dice,Full-time,False,Georgia,2023-01-04 16:36:07,True,False,United States,year,150000.0,78.12,"Engage Partners, Inc.","['go', 'python', 'r', 'sql', 'oracle', 'window...","{'cloud': ['azure', 'snowflake'], 'libraries':..."
21704,21704,785648,Data Scientist,Director Data Scientist - Commercial Platforms...,"Pleasant Hill, CA",via Ai-Jobs.net,Full-time,False,"California, United States",2023-04-12 06:02:51,False,True,United States,year,221875.0,115.56,84.51°,"['python', 'azure', 'snowflake', 'spark']","{'cloud': ['azure', 'snowflake'], 'libraries':..."
21705,21705,785682,Data Scientist,Data Scientist für datengetriebene Entwicklung...,"Reutlingen, Germany",via Ai-Jobs.net,Full-time,False,Germany,2023-03-04 06:16:08,False,False,Germany,year,157500.0,82.03,Bosch Group,"['python', 'hadoop', 'spark', 'airflow', 'kube...","{'libraries': ['hadoop', 'spark', 'airflow'], ..."
21706,21706,785692,Data Scientist,Data Scientist- Hybrid Work Location,"Dayton, OH",via Ai-Jobs.net,Full-time,False,"Illinois, United States",2023-04-21 06:02:31,False,True,United States,year,157500.0,82.03,Tenet3,"['python', 'matlab', 'r']","{'programming': ['python', 'matlab', 'r']}"

In [7]:
null_values = jobs["salary_year_avg"].isnull()

In [8]:
null_values

0        False
1        False
2        False
3        False
4        False
         ...
21702    False
21703    False
21704    False
21705    False
21706    False
Name: salary_year_avg, Length: 21707, dtype: bool